[
  {
    "productName": "Sony NW-S705F Noise-Canceling Walkman MP3 Player (Black)",
    "title": "Decent MP3 player, with its own limitations",
    "author": "S. Jacob \"stj60659\"",
    "createDate": "2007-05-19 00:00:00",
    "fullText": "dedicated mp3 player own devices play mp3s pros 1 sound quality bass enhanced significant degree decreased 2 player quality feel 3 battery life excellent 4 built system somewhat helpful 5 fm radio 6 headphones comfortable wear average quality cons 1 mac os 2 goes headphones unit headphones mp3 players 3 transfer songs sonicstage software prefer star mac os models unique headphone jack headphone paid 50 price consider buy excellent fm radio features excellent battery life",
    "rating": 3.0,
    "helpfulNum": 1,
    "totalNum": 5,
    "commentNum": 3,
    "webUrl": "http://www.amazon.com/review/product/B000MVJ1LG/ref=cm_cr_dp_all_summary/105-6702530-5922038?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/641"
  },
  {
    "productName": "Sony NW-S705F Noise-Canceling Walkman MP3 Player (Black)",
    "title": "Great little player for the price I payed.",
    "author": "Poojap",
    "createDate": "2007-05-25 00:00:00",
    "fullText": "purchased player 50 price complaints yes sonicstage bloated youll quit whining noise earphones sound eq settings battery life wonderful correct review headphones player cant players headphones device players bundled headphone extra notch fit players proprietary headphone jack headphone player jack prevent ive tried headphones player test sound compared bundled phones 200 decide battery life size active noise worth comparable players price payed wonderful flash based player id reccommend nano",
    "rating": 4.0,
    "helpfulNum": 2,
    "totalNum": 2,
    "commentNum": 4,
    "webUrl": "http://www.amazon.com/review/product/B000MVJ1LG/ref=cm_cr_dp_all_summary/105-6702530-5922038?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/641"
  }
]