[{"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen player", "author": "R. Stowell \"guitar guy\"", "createDate": "2008-02-22 00:00:00", "fullText": "absolutely incredible product musician looking plays excellent fidelity records internal mike clarity records faithfully line jack capacity allow carry info music gigs highly reccomend reasonably priced", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_19/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=19&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1405"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great Music Player; Not So Great Video Player", "author": "Peripateticus", "createDate": "2008-02-23 00:00:00", "fullText": "compared competition price range choice music player light interface intuitive easy set customize oled display visible angle dim outdoor lighting display sharp player photos video audio average replace included earbuds lots eq settings fm radio included creative mediasource organizer software makes loading tracks setup playlists easy listen lot podcasts disappointed included zencast software found mediasource media function automatically podcasts itunes library itunes makes podcast subscriptions easy readily dragged dropped zen noted reviews usb charging computer lot usb wall charger goes faster dont buy overall am fairly happy music podcasts", "rating": 3.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_19/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=19&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1405"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Is there a real user manual for this thing?", "author": "The Mature Videogamer", "createDate": "2008-02-24 00:00:00", "fullText": "okay mp3 player maybe theyre serious lack information available operation unit user manual supply youre left figure yourself im able download stuff except five songs bought itunes 99 cents im using trial error im devices picking left stop dont save book podcast dont unit time youre time runs unit shuts lost doesnt pick leave automatically mp3 players youre interrupted dont 20 save bookmark youre screwed menu menu push proper buttons correct learn trial error press proper length time lose press buttons youll lose instance listening book happen press tiny joystick exit playing previous chapter start book im sorry im cassette players cd players ive careful pressing button player mp3 players help user manual none online youre own beginning idea playlist information creative site information please menu system clumsy unfriendly unit clumsy unfriendly buy apple ipod userfriendly unit 2 stars im happy", "rating": 2.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_19/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=19&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1405"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Love it!", "author": "Donna Reynolds", "createDate": "2006-12-31 00:00:00", "fullText": "creative labs muvo2 loved unfortunately hard drive fried warranty expired policy charging tech support calls buy product lot research buying replacement considered ipod nano zune finally christmas money hand circuit city ready buy ipod salesperson mp3 player told zen money player market includes radio video capability photos huge capacity storing music files figured lose brought home set amazed intuitive software loaded ten cds rapid downloaded music hours entire download collection im fan fm tuner picks favorite rb station doesnt stereo highly recommend little player", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "AWESOME!!!!!!!!!!!!!!!!!! unbelivably better than the ipod... but...", "author": "Jeffrey J. Minneti", "createDate": "2007-01-02 00:00:00", "fullText": "awesome mp3 player except pros brilliant color screen makes easy doing using outside huge glare dont care people stupid thumb navigation fine mp3 player chosen mechanism scroll stuff real look size tiny awesome cons 3 weeks frozen 4 times 3 4 times simply fine unless dont paperclip heres con waiting times froze looked fine froze oh repeated process finding paperclip froze repeated process times emailed creative labs support thingy simple solution happens reset regular startup screens creative symbol saying zen plus creative symbol hold play button recovery menu comes run reboot couple cons video bad screen line encoding hard thats", "rating": 4.0, "helpfulNum": 9, "totalNum": 9, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Here's the Major Problem.........", "author": "C. Williams \"firefem\"", "createDate": "2007-01-04 00:00:00", "fullText": "software doesnt computer doesnt recognize unit fixed zen october else initially fell love loved download music car trips easier loved size outlook sync feature fm tuner freezing disconnect power source time putting tiny pin reset hole hit hidden button wont wont shut frozen beginning screen wont else wont hook computer repeated attempts reset frustrating able access reset button reason moving tried true ipod creative major design flaw dont buy unless frustrated", "rating": 2.0, "helpfulNum": 6, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Very Nice Little Gadget", "author": "Randy C", "createDate": "2007-01-05 00:00:00", "fullText": "bought mp3 player wife owning 30gb creative zen visionm am fan creative products zen plus neat looking player nice looking display crisp navigation simple little joystick bit tricky highly recommend product style function bonus music encoded using wma format reduce files sizes significantly 40 allowing fit music complaint typical nonipod players accessories zen plus visionm limited provided software takes time configure properly sync computer", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "I love it!", "author": "M. Brown", "createDate": "2007-01-06 00:00:00", "fullText": "zen plus magazine wonder compares ipod brother past christmas dont love size idiot proof smart comes gadgets downloading cds childs play downside time froze wait battery die hasnt happened buy product worth penny spend", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Constant connection problems", "author": "Luis S.", "createDate": "2007-01-06 00:00:00", "fullText": "player constant connection software player constantly freezes ive tried resetting player try download headache wouldnt recommend gift doesnt enjoy spending hours computer trying", "rating": 1.0, "helpfulNum": 5, "totalNum": 5, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Definitely one of the best MP3 players out there", "author": "C. Lin \"gtjohn\"", "createDate": "2007-01-09 00:00:00", "fullText": "bought creative zen plus browsing hundreds mp3 players flash based hard drive based read reviews finally decided product month using complaints whatsoever music videos pics easily onto player sound definitely suggest buying set headphones ones attached arent probably wont fit ears fm feature course reception depends live youre located reception unless youre screen definitely nice menus easy navigate wont regret buying product", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Simply amazing", "author": "A. Schwager", "createDate": "2007-01-09 00:00:00", "fullText": "pros sound quality ships quality ear pieces fits comfortably palm rounded edges smooth look expensive equivalent ipod syncs easily windows media player intuitive battery life cons havent found conclusion definitely recommend mp3 player looking", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Terrible Documentation", "author": "J. Samborn", "createDate": "2007-01-11 00:00:00", "fullText": "physically attractive features zen suffers serious limitations significant documentation grossly inadequate fails set forth utilize features example seen enable resume feature listening audio book shut unit indicate shut unit scrolling ahead carefully unit freezes rebooted earphone connection poor requiring restore sound ears ipod superior unit advantage zen ability items downloaded public library zen major disappointment", "rating": 1.0, "helpfulNum": 5, "totalNum": 6, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_2/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1406"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great Buy for 1st MP3, Great for Books & Music & More", "author": "BlueCornChip", "createDate": "2008-02-08 00:00:00", "fullText": "love zen plus 4 gb durable mp3 little guy lived wishes mp3 audio books music bookmarking 12 hour recorded book chapter time breaks music rich fm radio added bonus screen bright amazing resolution downloading microsoft outlook contacts snap firm ware froze couple times hard reset straight pin lost data negative lack user guide spent time surfing manual play unit features found quickly hint hold arrow bookmarking play modes creating play lists hope rechargeable battery 2 time tell buy money ipods rated price", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_18/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=18&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1931"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Outstanding portable recorder... with one major flaw.", "author": "Drive-In-Freak", "createDate": "2008-02-08 00:00:00", "fullText": "tapes records able archive computer mp3 player andor burn cd copies portable media player recorder major flaw line jack odd 25mm adaptable rare portable media player recorder meters close perfect digital copies audio source including analog recordings thats actually line jack sweet adapter adapter rca stereo 35 mm jack stereo included 25mm 35mm cable jack standard stereo 35mm headphone output jack recoding encoded 128 160kbps top notch audio fine 45s radio yes 8track 320 kbps 160 adequate built mono microphone makes decent sounding recordings yes itll play audio video files display pictures else bla bla bla audio output loud real user adjustable five band equalizer battery life battery battery user replaceable imho thats inexcusable goes dead youre home youre sunk likewise itll hold charge replace battery literally pry apart replaced technician recorder id 810 portable media player id 210 battery issue id 710 sounds wish output power", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_18/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=18&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1931"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Outstanding!", "author": "C. Callahan Mack \"Kauai Calls! Set Your Heart...", "createDate": "2008-02-10 00:00:00", "fullText": "product excellent terms form function cool looking love easy download music etc easy website information learn customer service via email phone available direct help", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_18/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=18&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1931"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "creative zen plus ", "author": "T. Sandridge", "createDate": "2008-02-13 00:00:00", "fullText": "purchased figuring nieces ipod mine yahoo fairly easy children enjoying hold music pod doesnt cost am glad product purchased", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_18/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=18&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1931"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Good player for audiobooks", "author": "K. Holmes", "createDate": "2008-02-16 00:00:00", "fullText": "mp3 players listening audiobooks podcasts im trying ive using month favorite ive found players ive tried power switch player overdrive books library books audiblecom havent tried netlibrary documentation provided dismal willing spend time figure own help user forums amazon creative forums installation cd included player lots horrible warnings connect player computer setting software interestingly booklet mentioned player computer doesnt software installed dont install programs help ive found player fine creative software windows media player fine overdrive audible own programs books handle transfers player suggest try special software player bookmarking function audiobooks music bookmarks intuitive figuring forums mentioned times try news im finding bookmark listening book player pausing resume playing powered unless listen book listen else bookmarks arent battery life charged player 810 hours bit shorter id ok player little joystick navigating menus ive seen reviews dont easy navigate screen nice readable dont store photos watch videos cant comment aspects player except supposed main 4gb storage nice amount carrying books listen nice readable screen easy navigate hear bookmarks resumes volume level player returns preset volume thats annoying size nice looking player feel im learning stage player feel ive discovered main", "rating": 3.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_18/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=18&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1931"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Good value player, but wasn't as flexible as I hoped.", "author": "Jen \"Jen\"", "createDate": "2008-02-16 00:00:00", "fullText": "nice little player easy hold lot money hoped able special software drag drop folders device drag songs hard drive player folder structure isnt navigate music device list playlists software software comes sync windows media hoping create playlists using device process tedious windows media player managing music playlists perfectly sound line recording feature", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_18/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=18&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1931"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "complete waste", "author": "K. Benz \"XsarycanaryX\"", "createDate": "2008-02-17 00:00:00", "fullText": "nice little player putting music pic etc randomly screen black look creatives site common returned im trying samsung ill luck", "rating": 1.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_18/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=18&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1931"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Long-time Creative user", "author": "E. Runnels", "createDate": "2007-01-14 00:00:00", "fullText": "ive jukebox zen xtra hasnt serious zen plus christmas froze days everytime freezes reset exchanged didnt play 2 songs froze ive tried player creative makes nice products opinion", "rating": 2.0, "helpfulNum": 6, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_3/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1932"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "awesome product", "author": "Scott Oliver", "createDate": "2007-01-16 00:00:00", "fullText": "zen christmas mp3 player ive ipod nano zen blew water affordable durable features 4 gb zen price 2gb ipod thats deal", "rating": 5.0, "helpfulNum": 1, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_3/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1932"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Died After 10 mins of use", "author": "Poor Grad Student \"NS\"", "createDate": "2007-01-16 00:00:00", "fullText": "ive waiting mp3 craze started purchasing zen plus features box downloaded 1 gig worth mp3s listen commute listened downloaded 1 min transferred ok morning 5 minutes heard loud sounds music playing player froze reset shut ok restart freeze start contacted customer support told reinstall driver firmware application sw tried reinstalling firmware player simply freezes customer service people told wrong send pay shipping found fixed charge player corrupted memory probably tried am computer expert dont time schedule fixing product box thankfully bought amazon returning simple granted product ipod reviews ive read im wrong quality control creative stay product", "rating": 1.0, "helpfulNum": 10, "totalNum": 12, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_3/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1932"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Awesome MP3 Player", "author": "T. Copening", "createDate": "2007-01-17 00:00:00", "fullText": "research product buy purchase 100 bad slightly picky 1 screen hard watch videos feature ive try mp3 player dvd player 2 zen freezing reset latter buying player reading difficult reset scared plunge real drawback happen refunded ive player week frozen twice disconnecting computer resetting simple time needle stuck hole reset time paper clip reset hole cant help hit button correctly resetting library rebuilt continued playback happened real drawback imho 4 friends ipod nano cost 60 mine features 3 4 envy zen linein encoding nice wish pulled track information instead line recording date fm radio customizable backgrounds love simple drag drop sending player files computer couldnt im thoroughly impressed satisfied player money mention looks ipod scratch resistant leather carrying cute", "rating": 5.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_3/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1932"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Good product except freezed in a week", "author": "Qing Chang", "createDate": "2007-01-18 00:00:00", "fullText": "mp3 player purchase flash memory based mp3 player bookmark capability listening downloaded audio book main purpose menu easy functionalities read pc installed manual figure setup bookmark stops yesterday five days bought froze button pushed reset button using pin hours froze time reset able bring soon screen froze matter times tried yesterday loading 2g music player issue loaded music hey 4g player", "rating": 2.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_3/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1932"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Nano Trump card", "author": "Jeffrey Smith", "createDate": "2007-01-19 00:00:00", "fullText": "reviews covered considering player ill express opinion include technical details found reviews player amazingly robust sexy owned apple nano prior appreciate players shorter thicker unit twice thick nano half height larger hands unit easier operate people complained reset unit 2 months ive technically unit stores location songs movies youve listening memory videos podcasts device inbetween syncing software exception videos convert putting player included zencast software subscribing podcasts etc allows sync finally device media storage device files desired ability throw music charge player pc huge advantage player nonapple products im grateful itunes", "rating": 5.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_3/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1932"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Not for music only!", "author": "Karen Wallace \"Karen\"", "createDate": "2007-01-29 00:00:00", "fullText": "mine audio books sermons talk radio podcasts music totally love 100 hours audio books 4 hours sermons 16 hours havent found radio cares dont listen fm anyway", "rating": 5.0, "helpfulNum": 10, "totalNum": 11, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_3/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1932"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Awesome little MP3", "author": "Terri L. Wilson", "createDate": "2008-01-21 00:00:00", "fullText": "love mp3 easy house easy load music create playlists player color screen love radio sometimes nice listen creative mp3", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_17/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=17&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2308"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Another broken player...", "author": "Eggplant", "createDate": "2008-01-25 00:00:00", "fullText": "following startup directions exactly charging 6 hours using creative software installed computer 4gb creative zen plus froze repeatedly playback trying shut entire device froze tried restart followed steps reset luck cant power left battery am returning amazon regret look player note potential buyers black player getting fingerprints looking greasy hand", "rating": 1.0, "helpfulNum": 1, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_17/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=17&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2308"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great Buy!  You will not  be disappointed", "author": "Tam \"Tamz muse\"", "createDate": "2008-01-29 00:00:00", "fullText": "zen excellent mp3 player am happy purchase holds lot music audio books looking mp3 player hold lot music reasonable price player stop thinking buy", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_17/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=17&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2308"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Be warned", "author": "Bern", "createDate": "2008-01-30 00:00:00", "fullText": "purchased 3 players b4 xmas kids 3 major am pissed players am writing product review 1 firmware crash day 1 recovery mode time limit walmart wish month onoff button player 2 pops wont daughter pen tip days daughter tells players firmware recovery mode search web link forum mp3 recovery tool creative run player error site program wouldnt complete rebuild library settings reset time pain tell product major buying product save bucks competition headphones player spend 30 decent set replaced player 1 walmart sony walkman difference quality screen headphones sound buttons sturdy easy wasnt closing dont mistake yourself available b4 buying", "rating": 1.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_17/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=17&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2308"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great design, but a lot of bugs, poor quality, and warranty repair costs 1/3 as much as a new player", "author": "Jay", "createDate": "2008-01-31 00:00:00", "fullText": "pros design design software features size cons poor quality bugs involve daily resetting warranty months purchase 35 price warranty coverage creative labs customer service service bull buy ear buds 10 cent ones life zen plus resetting pain tolerable constantly bookmarked location easily audio books ear buds junk players eventually player screen slowly faded days stopped 3 months owning careful damaged dropped padded plastic call creative warranty bad 2 weeks rma creative send warranty repairs sent info contacted 2 weeks hadnt gotten receipt copy didnt story short 3 fax machines 4 times emailing attachment pdf jpg file circuit history page finally days email requesting call provide handling theyll look looked warranty pay shipping wouldnt pay am stuck deciding pay half cost suck loss player", "rating": 1.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_17/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=17&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2308"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Weird static-sounding background noise between tracks", "author": "themonkrat", "createDate": "2008-02-02 00:00:00", "fullText": "bought impressed buttons quiet theres annoying library able hear little click someones phone mp3 player decided plug headphones listen sample music playing music sound quality impressive soon shifted track heard strange noise beep player cell phone interference noise sort record music plays little electronic maybe bug switched track im picky comes mp3 players player performs function playing mp3s doesnt am returning tomorrow note zen vision didnt weird noises changed tracks thats bare minimum comes mp3 players", "rating": 1.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_17/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=17&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2308"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "ATTENTION!!! PLEASE DO NOT BUY THIS PRODUCT!!! YOU WILL BE VERY DISAPOINTED", "author": "K. Burke", "createDate": "2008-02-07 00:00:00", "fullText": "buy product break 6 months screen die fix matter care naturally break design mp3 happen mp3 buy buy ipod sansa zune matter please buy creative products bought headphones repeat product break happen happened brother dozens reviews read online zen plus months screen completly break player stop am writing review people buying mp3 please pick product looking", "rating": 1.0, "helpfulNum": 0, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_17/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=17&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2308"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "battery....ugg", "author": "alyosha10", "createDate": "2007-01-31 00:00:00", "fullText": "returned cant deal replaceable battery thats deal wont buy ipods zen micro upgrade gadget heaven mp3 players change battery runs takes forever charge am disappointed creative horrific error judgement sansa instead", "rating": 1.0, "helpfulNum": 13, "totalNum": 16, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_4/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2309"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Decent choice for music and audiobooks", "author": "L. Bailey \"Not falling for it\"", "createDate": "2007-02-05 00:00:00", "fullText": "looking player support yahoo music unlimited subscription downloads audible books choices creative zen nano plus loved didnt yahoo zen plus yahoo software easily added 500 songs automatically synchs playlists audiobooks hard menu available genre section touchy keeping correct book tried fast forward kept skipping track restart beginning track press pause shutting tends skip backward battery life shorter zen nano music nice product handling audiobooks improvement", "rating": 4.0, "helpfulNum": 9, "totalNum": 9, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_4/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2309"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "GREAT MP3 PLAYER", "author": "Thejuanma \"thejuanma\"", "createDate": "2007-02-18 00:00:00", "fullText": "6 plus months ive using zen plus 4gb complaints sound quality excellent features menu stylish entire party happy music comments froze hit reset button fine recommendation buy car wall charger lot trouble save lot time look computer recharge wont charge computer software installed im 8gb", "rating": 5.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_4/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2309"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Terrific!", "author": "N. Connery \"Cat Mama\"", "createDate": "2007-02-19 00:00:00", "fullText": "cant bad little machine sound steady buy ipod mp3 creative product larger fit purse easier ill trips im 65 love dinner dreaded grocery shopping creative", "rating": 5.0, "helpfulNum": 4, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_4/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2309"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Okay for its price", "author": "Y. Ruan", "createDate": "2007-03-03 00:00:00", "fullText": "absolute guess ive tends freeze time time explanation manufacturers site due corrupt data dont happen except maybe converted cds formats ive creative products bummer id pick choices", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_4/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2309"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen V Plus ", "author": "M. Hale", "createDate": "2007-03-09 00:00:00", "fullText": "zen lot nice features easy setup software package included designed ipods dont features built zen vs plastic casing cheap feel compared ipods", "rating": 3.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_4/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2309"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Broken Power switch, Freezes", "author": "Harold D. Warren \"Hal\"", "createDate": "2007-03-15 00:00:00", "fullText": "zen plus 3 weeks ago froze times couple days downloaded firmware frozen twice trying bookmark book difficult yesterday power switch fell lost trying day response customer support mail phone able auto response via mail respond 24 hours able hold speak customer service dept player sound poor battery life freezes poorly constructed wish shopped little", "rating": 2.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_4/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2309"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "A Great Alternative", "author": "Kurt Schade", "createDate": "2008-01-07 00:00:00", "fullText": "enjoy product easy manage using software provided quality sound makes decent flash drive theres didnt care thats menus nice menu artist kinda silly", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_16/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=16&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2628"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "I LOVE THE ZEN V PLUS!", "author": "Thomas P. Gross", "createDate": "2008-01-07 00:00:00", "fullText": "mp3 player reading reviews hard purchasing player purchasing am glad loaded songs songs ripped own collection cds loaded photos videos recent trip hawaii doing software selfexplanatory basically drag drop zen plus folder top synched zen outlook contacts zen menu system easy navigate easily music play watch love compact feel zen am glad purchased product", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_16/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=16&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2628"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Second Time Around", "author": "J. Cash", "createDate": "2008-01-07 00:00:00", "fullText": "personally review product purchased gift son christmas pleased called couple times tell pictures songs downloaded daughter product purchase based recommendation pleased product purchase based buyers dont wrong purchasing item", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_16/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=16&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2628"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Documentation please!!", "author": "Plant Doctor \"gpmsu\"", "createDate": "2008-01-11 00:00:00", "fullText": "mp3 player basic 1 gig creative player sound easy windows explorer unfortunately device virtually instructions handles mp3 files software bad expected categorize music using folders subfolders etc computer finally realized emails creative player doesnt tags associated mp3 files firmware categorize music unfortunately nearly ripped cds tags mess fortunately able add tags mp3 files entire 350 cd collection documentation explaining file handling etc saved hours aggravation allowing windows directory approach easier recently discovered brand player approach lacks documentation files categorized etc manual mention files categories tags didnt explain added edit pain overall sounding compact player ac charger", "rating": 2.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_16/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=16&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2628"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great little player at low price", "author": "D. Carr", "createDate": "2008-01-12 00:00:00", "fullText": "mp3 players am pleased sound intuitive controls arent easily accidentally activated carries favorite features didnt consider ability record audio input streaming internet radio songs individual files", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_16/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=16&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2628"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Awesome Player - Great Price", "author": "Michael J. Gratis, Sr.", "createDate": "2008-01-13 00:00:00", "fullText": "checked online reviews deciding creative zen plus 4 gb highly bang buck disappointed dont size appearance fool hang menu system easy intuitive sounds set earphones appears fairly durable id expect stand short outright abuse ive variety mp3 players bottom line ive expected highly recommend cant comment included software linux 103 windows reformat zen mtp device install 2 associated native device flawlessly", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_16/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=16&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2628"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Simple & excellent player", "author": "Y. Flashner", "createDate": "2008-01-17 00:00:00", "fullText": "look device listening am amazed sound quality coming simply excellent device sound easy navigation easy management battery life cute carry neck supplied lanyard train riding bike cant happier sound quality sennheiser headphones probably ipod scrolling speed using joystick scrolling sensitivity joystick comfortable anyway control opinion 5 starts device opinion price steal dont amazon", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_16/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=16&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2628"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great if it's what your looking for", "author": "Amanda Ryan", "createDate": "2007-03-20 00:00:00", "fullText": "replace zen cuz broke decided upgrade holds music battery lasts week thats everyday players sleek compact screen enjoy friends feel", "rating": 5.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great Product", "author": "Joanne Madden \"Joedamadman\"", "createDate": "2007-03-20 00:00:00", "fullText": "creative zen plus price cant beat player zen 3 months wow features competition price pros price line crystal microphone con froze twice expected mp3 player", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Awesome mp3 player!", "author": "Joyce", "createDate": "2007-03-24 00:00:00", "fullText": "love expected easy running zen micro previously touch screen toggle fingernail easy short nails headphones sound muffled sounding sweat ones", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Breathtaking", "author": "Prabha Kularathna", "createDate": "2007-04-01 00:00:00", "fullText": "bought zen wow simply breathtaking begin firstly tried ipod friend mine aspect sound quality bit own creative stuff hoped creative mp3 player job little player excellent sound quality spectrum exceptional sn ratio am satisfied pros player nicely fit hand youd youd hands dont toy device usable menu convenient 2 buttons joystick behaves exactly people joystick button bit tight cheap feel look player looks totally product information mentioned player root menu item reads simply menu player attractive sophisticated artwork share attention otherwise gone song listen music player support capturing attention focus music player screen quality creative oled bright lcd oled display viewable angle unlike lcd consumes power ability view angle ability play video fm radio ability record linein audio adds value package sound quality fm radio recorded audio builtin mic extremely casing screen covered scratchresistant layer player dropped impact lose hopes picking player fine able scratch mark impact truly scratch resistant software kit convenient manage play lists etc quickly cons battery charger included takes time issue", "rating": 5.0, "helpfulNum": 10, "totalNum": 10, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great Mp3 player . . . When it works.", "author": "Leeroy Jenkins", "createDate": "2007-04-07 00:00:00", "fullText": "purchased replacement zen nano plus died sudden death figured dropped times pocket electronics ie pdas cell phones mp3 players hard life left house admit paces biggest buttons joystick whenever feels pressure activate expect device 12 34 weeks besides love player screen isnt watch fulllength movies wont doing anyway doesnt matter pictures fairly sound quality dont listen music ill read listening sound quality doesnt bother battery life short charge im lucky 6 hours listening time consideration player isnt isnt bad everyday run mill average mp3 player highly dissapointed", "rating": 3.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "battery life is short", "author": "Edward Wu", "createDate": "2007-04-23 00:00:00", "fullText": "model battery life 9 hrs 15 hrs extend battery life equalizer lower bitrate songs lower volume short battery life youre planning trips annoying headphones bit uncomfortable ears creative media explorer software easy sync music pc files couldnt transfer option option allows compress file transferred zen error music files question audio file music files transferred successfully disabled option transfer mp3 files overall feel product offers lot price liked battery life charging time 6 hrs actually 3 12 hrs acceptable compared ipod", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Little player, little enjoyment", "author": "M. C. Nemeth", "createDate": "2007-04-25 00:00:00", "fullText": "id spend little ipod extremely low output aux stereo systems screen kept getting completely black luckily warranty period 3 months creative horrible deal customer service stand youd buy player id doesnt require additional weeks bad using town workouts dont expect whats available", "rating": 1.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great MP3 player", "author": "Burl M. Finkelstein", "createDate": "2007-04-27 00:00:00", "fullText": "fidelity amazing capacity record line form cd player cassette video clips tiny size unit wife received gift loves purchased fm adapter car charger suggested capacity mp3 unit", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_5/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2629"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "zen mp3", "author": "M. Timmins", "createDate": "2007-12-27 00:00:00", "fullText": "cheaper coby disappointed continued research look device download audio books music device beautifully price reasonable hope decent amount time", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Disappointing", "author": "talula31", "createDate": "2007-12-27 00:00:00", "fullText": "bought didnt ipod monopoly excited fm radio rarely reception organizer waste space figure set clock played music bought screen play album listened downloaded updates recovery tool creative eventually player stopped waste money didnt ipod accessory designed ipod mind sometimes", "rating": 2.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Doesnt work with mac", "author": "Jesse D. Foster", "createDate": "2007-12-28 00:00:00", "fullText": "considering product own mac recommend look elsewhere program supposedly supposed mac mp3 player mac didnt recognize player addition attempted upload firmware using dads pc failed read player im defective wouldnt read computer own mac ipod save self hassle", "rating": 1.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": " Creative Zen v plus- great product", "author": "Dana Cooper \"Birdie\"", "createDate": "2007-12-29 00:00:00", "fullText": "purchased mp3 player daughter searching reviewing purchasing product amazon amazon price insisted apple ipod zen functions mention 4gb holds songs apple ipod 4gb daughter pleased size durability functions suit definitely recommend product", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen V plus mp3 player", "author": "Guido Valeri \"G\"", "createDate": "2007-12-30 00:00:00", "fullText": "champ tried 2 brands remain freeze seamlessly rhapsody music service extremely light compact doesnt look cheesy finally nearly endless battery life highly recommend", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Display went black, terrible warranty support", "author": "Mark Orton", "createDate": "2008-01-01 00:00:00", "fullText": "bought daughter sept display fading couple months finally died december annoying lasted past 30 day amazon return creative cost 25 labor returns outrageous 25 product cost assuming honor warranty due lack medium term reliability added insult paying warranty service buy creative product", "rating": 1.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "It Didn't Work, and Now I Have to Pay", "author": "S. Hayes", "createDate": "2008-01-03 00:00:00", "fullText": "zen plus box tech support told return guess pay ship thats creative makes crappy product stuck trouble expense returning research fix people glitch apparently deal buyer beware", "rating": 1.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Zen review", "author": "ATC NJ", "createDate": "2008-01-05 00:00:00", "fullText": "music player lot playing digital books download local library public libraries compatible ipods bookmark feature thats helpful downfall player freezes fast forwarding pin handy stick little hole reset", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_15/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=15&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2898"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Don't buy this...too big of a chance of getting a bad one. ", "author": "SMS \"Sherry\"", "createDate": "2007-04-29 00:00:00", "fullText": "bought husband circuit city neat looking kids creative products zen amazon returned amazon froze play song amazon btw wonderful customer policy load songs zen bought husband froze 60 songs 4 gb reset format device tried including downloading firmware etc sadly able return cc didnt realize return period return creative paying 8 mail sent unit exact supposedly sent complaints supervisor responded unit hold hundreds thousands songs load 60 songs rip proven creative monkey warranty expires", "rating": 2.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Power switch is buggy/doesn't always work", "author": "Jason Scarano \"Panic Goodpeople\"", "createDate": "2007-05-10 00:00:00", "fullText": "power switch zen plus doesnt occurs usually sitting 6 hours play switch 10 minutes power doesnt integrate natively itunes biggest concerns regardless pc mac integrates itunes etc havent heard complaints friends own nano stay zen", "rating": 2.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen V Plus -  CAUTION - DO NOT BUY", "author": "N. Tanna", "createDate": "2007-05-12 00:00:00", "fullText": "creative products absolutely broke month display dark faint red letters people search google product creative creative zen micro broke headphone pin loose suffered people search google creative 3 months labor warantee products break shell lot money hardware warantee 1 trap", "rating": 1.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "cute...but not enough.", "author": "Florence \"=)\"", "createDate": "2007-05-16 00:00:00", "fullText": "doesnt accept file formats music transferring music simple lost cord attach computer buy online seller charge creative zen cant darn screen sunlight clicker slower ipod battery life cute size oh ive learned lesson", "rating": 3.0, "helpfulNum": 0, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Technologically sound, mechanically defective", "author": "David V. Head", "createDate": "2007-05-16 00:00:00", "fullText": "chose zen plus couple reasons fantastic price ipod couldnt sadly shortly crack growing steadily joystick finally splitting thin plastic exchanged hopefully problematic players encountered freezing reset button didnt sent refund bad luck seeing encountered forewarned plastic fragile werent manufacturing 5star rating", "rating": 3.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen - So Far, Fantastic; Update the Firmware Before Using", "author": "", "createDate": "2007-05-18 00:00:00", "fullText": "ive zen plus 23 months beautifully chose zen instead ipod bound itunes interface im drag drop sort person soon device download update firmware creatives website downloads section january 07 release noticed plenty complaints firmware faulty firmware freezing survived field trips passed excited middle immediately cute similar addition commented ipod due fm radio capability capacity hard drive own ipod nano 2gb close friend own zen scratches visible nice close voice recording entertaining hours quality bit mediocre subtitles impossible read nice time watching clips anime media wouldnt recommend watching episode nice field trip price versus video ipod friends owns ipod comments precise volume control clicking updown button notes tried changing volume own ipod accidentally clicks wheel wrong nearly blows eardrums strain ears nonetheless surprisingly durable ive knocked onto floor banged couple times upright bass music include major lugging string instruments worth mentioning happened bathroom home earbuds listening zen counter im law evil course arm grab towel wipe hands zen sink draining quarter inch water quickly slightly wet incident quickly shut wiped towel hoping waited dry lo behold functioning correctly granted wasnt water youd called completely submerged damage happened didnt im thankful time ive reset decided view video hadnt converted beforehand device froze fortunately reset button quickly remedied freeze learned impatient transferring media onto probably wont correctly course ive months wonder namely joystick hold future pros smart volume keeping volume blowing ears phenomenal sound disabled enabled wish capacity price durability fm radio voice recorder customizable color themes backgrounds jpeg pictures loaded onto device cons video size tiny screen charging period bass amplifier renders slightly scratchy sound seemingly delicate joystick overall havent updating firmware cant joystick navigation times tough little device hope enjoy months", "rating": 5.0, "helpfulNum": 10, "totalNum": 11, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Not Reliable", "author": "Jelbrown", "createDate": "2007-05-22 00:00:00", "fullText": "purchased zen plus freeze reset 4gb screen gone blank product 6 months trouble units purchased cheaper products trust creative labs products ive tried online fixes send product creative labs fee course post results", "rating": 2.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "great player", "author": "Y. Li \"princessporkie\"", "createDate": "2007-05-25 00:00:00", "fullText": "player didnt spend sometimes freeze doesnt happen suck figured trick wear freezes train bus fit lil hole resets am hearing music player froze twice music skipping rewind front song plays song flip list albums artist song hear dont type name search money am looking buying traveling speakers", "rating": 4.0, "helpfulNum": 4, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Very satisfied with the product", "author": "JM \"Dallas Cowboy\"", "createDate": "2007-05-30 00:00:00", "fullText": "pros drag drop compatibility fm tuner voice recording photos videos feature colors screen sleek design decent battery life click wheel price atleast 70 cheaper 4gb ipod nano cons location buttons deal headphones supplied fit tight ears lack accessories bought 95 penny worth satisfied", "rating": 4.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Review", "author": "Ronald N. Hoffman", "createDate": "2007-06-01 00:00:00", "fullText": "player crashes plugged computer brought reset button screen hard daylight sometimes impossible sound quality broke lanyard attached shocked buy player ipod found task mobile situation creative zen 40gb hd model lived 2 ipods shape hope update player dead fallen asleep pocket headphones ear buds crushed lcd pocket am cell phone 3 4 day mp3 player 1 intermittent", "rating": 3.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_6/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2899"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "zen player", "author": "Carolyn Raihl \"C.Raihl\"", "createDate": "2007-11-29 00:00:00", "fullText": "am pleased service recently recieved amazon didnt recieve zen player amazon sent thank am daughter christmas christmas zen player thank assistance", "rating": 4.0, "helpfulNum": 1, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Most  fun new toy!", "author": "C. Tiffany \"dogwalker\"", "createDate": "2007-11-29 00:00:00", "fullText": "easy performs expected lock twice times zen portable system day listen books drive time warning loading music pc dont windows media manager auto sync 500 pictures zen books music remove negative trying figure rewind books listen miss radio ok bit figure stations", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Better than an Ipod", "author": "N. Emery", "createDate": "2007-12-03 00:00:00", "fullText": "wore creative zen 1 upgraded plus 4 gb love easy im real computer literate lots memory 3 books downloaded netlibrary free 4 christmas albums ripped collection takes 1 gb download pictures videos listen fm radio voice recorder name functions buy ipod", "rating": 5.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great product with excellent support for anyone with half a brain", "author": "David Milikin \"GuitarDave\"", "createDate": "2007-12-03 00:00:00", "fullText": "little player incredible array features manual buried deep creative program mentioned program zen series shortcut easier youd thorough creative website improves album art quality easily converted software recording course ive moneys par cowon feature packed device thumbs 5 star self", "rating": 5.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Zen V Plus - brilliant", "author": "Mr. P. Smith", "createDate": "2007-12-15 00:00:00", "fullText": "zen plus 4gb ive zen 3 months am delighted performance exceeds expected creative claim days home sound quality hangs neck included lanyard youve selections tuck inside shirt top pocket unobtrusive screen bit videos plays easy convert included software included software fine reading reviews bought copy mediamonkey integrates perfectly zen pass recommendation download trial version try commit bonus didnt expect line ive connected headphone socket hifi vinyl collection special links computer treat brilliant bonus voice recorder press record button matter youre playing time hold microphone speak notes resume playback easy reasonable tool environment student model larger screen video recommend plus suggest video try zen otherwise plus superb", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Tech Support Responded Quickly Even Pre-Purchase", "author": "Sterghe", "createDate": "2007-12-18 00:00:00", "fullText": "zen plus audiobooks players tested netlibrary free books public libraries including mine reviews amazons question section player netlibrary common response price range common response range margin couple reviews worried didnt buy dud poor tech support visited creatives site tech support directly respond concern purchased sent email 7 pm 2 am friendly reply including paragraph please note purchase zen plus 60 days free phone support 1 email support encounter issues player questions features free email happy assist explored extensive knowledge base website im pretty comfortable computer else online tech support database looking probably solution common wait tech support add months telephone support quick turnaround sent tech support directed folks respond player froze id read couple reviews sales department im money tech support resolved id share experience else quality tech support based reviews", "rating": 5.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Changed  My Life", "author": "Nina-Marie \"qudiva\"", "createDate": "2007-12-18 00:00:00", "fullText": "ive owned zen 7 months everyday half music couple audiobooks time photos frozen 3 times months love little size scratch ease software included dont cant reorganize files loaded ill misplace song cant broke switch nail caught exercising using pen switch joystick ipod navigation pad bookmark audiobooks cant rewind paid doctor", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Half a product in the box", "author": "W. Roeske", "createDate": "2007-12-27 00:00:00", "fullText": "purchased product specifically able download audio books library listen music zen plus mp3 players capability 1st instruction manual 60 pages 12 english none adequate instruction loading music player 2nd incompatible windows vista sent email tech support received quick complete reply told download 4 applications 99 meg unit compatible vista able download audio books manage files addition directed website gain instruction download music audio books believe complete product shipped sold sold book player voice recorder picture viewing creative ashamed market", "rating": 1.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_14/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=14&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3134"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "I have a papper clip taped on the back", "author": "Alvin M. Legate \"Some one who loves musuc\"", "createDate": "2007-06-16 00:00:00", "fullText": "nice little player voice listen pics videos loves size main reasons player 4gb 4 days froze didnt happened found reset button paper clip ear ring doing player freezes paper taped paper clip player", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Awesome", "author": "C. Mandry \"C Mandry\"", "createDate": "2007-06-16 00:00:00", "fullText": "paid 100 total 4gb zen plus paid daughters ipod nano sound quality ease light love mine daughter wishes gotten mine instead seen complaints controls hands isnt am average girl reccomend looking 4gb bargain bargain 8gb little bigger space wish little bigger little bigger screen price size awesome", "rating": 5.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Little, compact, but great!", "author": "H. JensenHof \"Amicus verus\"", "createDate": "2007-06-26 00:00:00", "fullText": "doing lot research mp3 players chose zen plus 4 surprised purchase believe chose wisely people seen wear zen neck ive fallen cant funny zen device easy easy navigate extremely easy rip music dont bother instruction manual doesnt tell complaint zen manual confusing doesnt contain information tools written languages aside experimenting zen able quickly manage sound quality ability changes equalizer simple earbuds awhile arent provide sound quality march beat own drum ipod am glad didnt am pleased zen plus", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "This think rocks!", "author": "Vicki C.", "createDate": "2007-06-26 00:00:00", "fullText": "zen 2 months ago love pocket listen tunes time time froze trying hook play car radio bought store sucked juice battery zen hooked computer recharged battery fine havent tried hooking car havent freezing ive software napster bought cover protect digital camera else absolutely hated ear buds bought ones product price perfect happier", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Not an Ipod Yet but a good 2nd Choice", "author": "Tyson Stull \"T2Stull\"", "createDate": "2007-06-27 00:00:00", "fullText": "compares mp3 player ipod own 2 ipods am zens controls ok little joystick center pain bigger hands trying 2 ie drive change songs job menus organizational software windows vista plus services yahoos music service music run lot cheaper itunes suggestion ipod mp3 player zen dont deal itunes music subscription service", "rating": 4.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great...While it works", "author": "Debra Carter", "createDate": "2007-06-28 00:00:00", "fullText": "zen happy 3 months screen blank spoke people zen happened told am lucky zens stopped completly recomend product ipod price heard lot reliable", "rating": 2.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "near perfect", "author": "L. Bates", "createDate": "2007-07-03 00:00:00", "fullText": "zen gb 4 gb zen ive 4 months controls easy especially tactile feedback joystick typical thumbs ive dropped times accidentally screen held battery life near 15 hours extended vacation drives 700 miles days lifesaver single zen own im waiting 8 gb price update 8 months locked reset easily time battery run 2 locks 8 months mp3 player creative product", "rating": 5.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Disappointing after less than a year.", "author": "Thursday Pollum", "createDate": "2007-07-05 00:00:00", "fullText": "received zen plus christmas 2006 started using extremely happy nicely screen sound quality time froze didnt found reset button searching object happened numerous times extreme pain deal secondly joystick improvement pain personally lot songs player band song falls hold time song usually wind passing requires thumb pressing ill push stick wrong lose list list start top song weeks ago joystick time screen started darker lack charging tendency bring school forget bag morning plugged computer cord improved main creative website found wrong reason screen players sometimes darker darker eventually black cant fix send id fine requires saved receipt received mine gift dont receipt hopes ipod experiencing makes return ipods considering buying consider carefully pros cons", "rating": 2.0, "helpfulNum": 5, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_7/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=7&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3135"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Not for compulsive organizers, freeway drivers, the particular", "author": "wild animals", "createDate": "2007-11-03 00:00:00", "fullText": "bought player simplify drive weekend mistake ive 24 hours ive reset times yes updated firmware player died wouldnt froze wouldnt unfortunately player rebuild music library time reset 5 minutes 30 times music stopped playing reason press pause play play drove 5 hours battery totally dead started charge player instead sleeping time pause run phone call whatever dont time start takes makes pathetic plastic noises handle pushing buttons buttons pieces plastic touch organization navigation suck car stereo plays mp3 cds navigation painfully simple press joystick flip folders press left choose song easy assumed mp3 player zen plus similar wrong zen plus sorts tags choose select artist album genre select tracks compilation zen plus 100 artists comp albums player couple hundred artists artist list yes sometimes scroll hundred artists mention player im driving cant scroll drive guess simplify process hooking zen computer mp3 management software creating playlist software joke regardless playlist navigate menus pick playlist scroll list cant resort list eg artist album title tell playlist songs flip 300 update list time addremove albums player alternative playlists scroll dont shouldnt story short ha ha access albums select album scroll songs individually hundreds stop album menu navigate album playlist cant youre driving player doesnt album beginning album stops repeat daylight playlist skip entire album push button skip song album list 20 songs album dont youll push 20 times past able listen albums continuously alphabetical band album title skip entire album dont feel hearing isnt alarm feature nonsense alarm black dialog box screen alarm headphones player insulting feel awful sound rotten distortion volume level 8 25 im im wondering dropped okay sell guess player dont look controls operate dont look screen mean easy tell control touch cant creative zen plus personally tried kill im totally thats true review inaccurate please advise cant return piece id useless aggravating id consult user manual essentially useless thanks reading please excuse negative tone am disappointed hope luck ive im glad didnt buy bunch expensive accessories realized hate", "rating": 1.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen V Plus 4 gb", "author": "Sylvia", "createDate": "2007-11-03 00:00:00", "fullText": "ive player months frozen mp3 player am pleased using software rip cds pretty easy intuitive playlists using software easy sound quality opinion headphone shape tendency fall ears try walk havent tried video dont easy downloaded zencasts easy people unlikely able 2000 songs player believe 1000 maximum", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "don't buy if you expect it to work", "author": "Rachel", "createDate": "2007-11-10 00:00:00", "fullText": "bought day bought scrolling list songs froze waited minute tried wouldnt returned night light couldnt figure battery getting songs easy mine wouldnt create playlists putting songs entire section playlist instead single song trying apparently im messed version product id highly recommend getting else sandisk currently own sandisk e250 love", "rating": 1.0, "helpfulNum": 1, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Rather disappointing", "author": "C. Holzwarth", "createDate": "2007-11-12 00:00:00", "fullText": "creative customer service past purchased vista compatible restore system backup disks trying install system crashed frequently installing emails creative device crashes weeks carry paper clip reset disappointing", "rating": 2.0, "helpfulNum": 3, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Do not purchase for Audiobooks", "author": "T. Hughes", "createDate": "2007-11-13 00:00:00", "fullText": "update trying product audiobooks frustrated late return drawer dont look am search mp3 player audiobooks previous comments purchased zen plus audiobooks recently discovered online libraries free audiobook downloads alas books ipod compatible comparison ease video ipod zen plus ipod move book book rarely lose zen plus middle chapter guarantee lost moving forward backward chapter audiobook ipod simple click wheel zen plus exercise frustration move interface using toggle try advance couple minutes zen freeze unit solution reset inserting paperclip rebuild library tendency skip section book searching chapter 21 chapter 4 forget estimated battery life 15 hours searching lost book battery power drops rapidly unit 4 gb nice little screen libraries offering downloadable books hopefully unit designed accommodate audiobook listeners forthcoming", "rating": 2.0, "helpfulNum": 10, "totalNum": 10, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Disappointing in so many ways...", "author": "John", "createDate": "2007-11-17 00:00:00", "fullText": "product significant flaws mark progress compact size hate software download softwarefirmware creatives site successfully installed zen series media explorer numerous applications cd installed laptop looks windows explorer allows cut copy song mistakenly placed separate folder rest tracks album wont paste belongs paste songs photos whatever folder fit file device cant move proper folder organizer redundant application worse called collection album hits 60s song goes own folder plays mp3s copying music cd windows media player format wma convert mp3 buy software cd installed useless yahoo computer tried change web home page yahoo sign special offers watch check boxes catch uncheck avoid yahoos doesnt wall spend time computer dont sit charge note ipod doesnt comes usb charger time buy stuff spent spent ipod ipods bad reviews people ipod try creatives idea customer support discussion web site discussion terribly messy products isnt product 10000 posts luck loud volume near maximum time pain song theres organize youve stored mess listing applications update 1 bunch cds album sometimes track rest elsewhere 2 copied podcasts mp3 format recordings folder copy ran mp3s recordings folder explorer app guess werent device 3 copied pictures folder device pictures folder wouldnt move folder unusable hated try zune ipod crummy software absolutely ruins", "rating": 1.0, "helpfulNum": 6, "totalNum": 9, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative doesn't seem to like their customers", "author": "TheCafeWriter", "createDate": "2007-11-17 00:00:00", "fullText": "ive 24 hours im disappointed documentation minimal exists scattered web pages 2 printed pdf file installed deep program files folder pc theres single source basic documentation support available email site check manual phone manual web site cd ripper comes player rip mp3 format apparently charge 10 able sent dead link web site theres discussion forum youre workarounds device perfectly adequate compared competition negatives buy comparable brand thats", "rating": 2.0, "helpfulNum": 4, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "I love it!", "author": "K. Sanders \"Gadget Girl\"", "createDate": "2007-11-21 00:00:00", "fullText": "recently purchased creative zen plus 4 gb nano pleased am able grasp player easily friends ipod am able joystick software easy install easy recharge battery life excellent pleased sound quality plain cute minor cons screen hard bright sunlight smooth exterior sometimes smudged look excellent buy money purchase product", "rating": 5.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Piece of Junk!!!!!", "author": "Traveller", "createDate": "2007-11-21 00:00:00", "fullText": "looks easy add delete songs videos photos etc thats product 4 times bought amazon 4 times froze twice freezes none functions switch etc reset unit paper clip pin difficult subway bus return product amazon past 30 day period stuck thinking contacting manufacturer luck remember buy box pins unit looks", "rating": 1.0, "helpfulNum": 2, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_13/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=13&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3341"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "DON'T BUY", "author": "J. Sutliffe", "createDate": "2007-07-09 00:00:00", "fullText": "player ok 3 weeks occasionally freezing started freezing times day cursor scroll menu touching toggle switch couldnt choose selection toggle cursor wouldnt stay selection returned amazon exchanged amazons return department 5 stars player fine 4 weeks freezing constantly reset button wont reset battery run recharge shame neat little player", "rating": 1.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Keep on looking, this MP3 player needs to be renovated", "author": "C. Massicott", "createDate": "2007-07-13 00:00:00", "fullText": "liked product hours stopped froze reset button searching net answers found instances amazons fault creative company tweaking product", "rating": 1.0, "helpfulNum": 7, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Zen V Plus for audiobooks", "author": "D. Jordan", "createDate": "2007-07-17 00:00:00", "fullText": "theres bit learning curve zen plus master controls learn menus downloading listening books music mainly audiobooks complaint pause short time player goes beginning track havent set bookmark sometimes little tricky fastforward function return left sometimes hold player freezes push reset player marks lowcost alternative ipods", "rating": 5.0, "helpfulNum": 9, "totalNum": 9, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen V Plus 4 GB Portable Media Player ", "author": "William Chapman", "createDate": "2007-07-22 00:00:00", "fullText": "mp3 player functions 30000 ipod am pleased performance 9900 rewind fast forward listen audio books miss start track begining couple hours", "rating": 4.0, "helpfulNum": 7, "totalNum": 7, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Is this player worth even $25 to me?", "author": "Percival", "createDate": "2007-07-29 00:00:00", "fullText": "switching flash player months ago decided zen plus zen nomad fairly hiccups increasingly unhappy player time am furious moment design play buttons integration casing provide reaction found pushing play happened focus mind pushing location respond joystick awful fond scrolling menus push represent selection volume buttons fine power slider pocket player tiny mp3 player pocket look players easy blind particular player using little joystick move backward forward track easy mistake wrong direction players dedicated buttons usually simpler operate blind audio book usability dont normally listen music audio books instead loved zen nomad ive track am pause zen pause zen shut player restart beginning track simply shut player currently listening player remembers location am listening book pause reason listen else break 10 10 minutes player automatically shuts boot lost position directly position book pausing screen screen low resolution appear pixelated fault player care able read text easily apparent screen getting darker quickly seen unit displayed screen unless backlight means currently playing look menu push button machine doing prefer look screen time tell playing approximately months ownership screen died completely player plays music look menu change selection player worthless help request help request creative website doing single troubleshooting pages website major chore link click product information america music player zen zen plus annoying sent detailed amount information giving description dead screen 24 hours response saying sound request rma listed charges occur charges 3 months warranty loved bottom email dont buy accessory player website rma charge 25 labor labor broken issue player 1 warranty replaced broke emailed complaint 25 responded 24 hours 25 test player broken understand reasoning extent bugs troubleshooting replacement email referred handful products buy decision pleased product start question player worth 25 comparable player 25 spend 25 unhappy product hope die spend else decided brand", "rating": 2.0, "helpfulNum": 11, "totalNum": 12, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Problems with Creative software", "author": "T. Rourke \"T J Rourke\"", "createDate": "2007-07-30 00:00:00", "fullText": "player software caused creative mp3 player nomad jukebox zen xtra portable fm radio ok zen plus software wouldnt install properly single module installed pc raised sort failed launch error message installation failed looked rolled changes software start menu applications wont uninstall top am unable software using player worst am unable uninstall applications computer players software screwed installer software contacted tech support gotten response creative store players fine dont youre install creative products pc", "rating": 1.0, "helpfulNum": 8, "totalNum": 8, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Impressive. Great for audio books. One small bug.", "author": "Tetranz", "createDate": "2007-07-31 00:00:00", "fullText": "bought zen plus audio books podcasts im impressed happy bookmark feature mp3 wma winning feature lacking players controls easy user time read manual installed cd information paper booklet pleasantly surprised fm radio photo video functions expected issue pause track shut beginning track power issue pause dont soon automatically shuts 5 minutes loses shutting playing instead pausing dont ill time power convenient pause play firmware bug hope fixed time wonder else noticed issue", "rating": 4.0, "helpfulNum": 8, "totalNum": 8, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Zen 4 GB player", "author": "m. reich", "createDate": "2007-07-31 00:00:00", "fullText": "bought daughters 15th birthday loves didnt look size looking buy surprised 112 2 12 inches happy amount gigs perfect player battery life nano ipod nice skins offered purchase own larger 30 gig zen issues course look zen happy specs comparisons zen decided buy comment purchase found weeks browsing local electronics store regular price happened past purchases purchasing amazon eight return marketplace purchase amazon easy satisfied purchases trust online business amazon hesitate look deciding buy online", "rating": 5.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Excellent MP3 Player", "author": "Thomas H. Rousse", "createDate": "2007-08-06 00:00:00", "fullText": "ipods death decided ready mp3 player moment held zen hand mp3 player interface form factor zen plus magnificent feels perfectly little hand easy colors bright screen direct sunlight reasonable distance buttons somewhat awkwardly placed orientation display changed options try rotating 90 degrees buttons lot sense video playback voice recording fm capabilities gimmicky found audio quality slightly superior ipod powering set sennheiser headphones cant talk durable mentioned broke previous ipods fairly quickly dropped carpet concrete rocks etc isnt scratching pocket included software simple straightforward 4gb hard drive makes update music collection wouldnt dont miss 30 gb music dont listen unfortunately creative followed trend mp3 producers included dedicated charger instead relying usb 20 takes roughly 46 hours youre looking music player immensely appealing physical design durability easy software look creative zen plus mind hardware difficulties listed review refer earlier released models 2 gb average electronics product 35 failure rate purchase hesitation", "rating": 5.0, "helpfulNum": 7, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Solid, Small, Capable MP3 player", "author": "Simeon Hein \"Planetary Intelligence author\"", "createDate": "2007-08-07 00:00:00", "fullText": "zen plus nifty little device lot audio tasks audio player recording displays jpeg pictures video files found usability zen size hold button activate player prevents accidentally mistake pocket battery management designed display dims press buttons zen isnt playing automatically minutes features found hours play unit recharging hooking usb port computer sound quality surprised zens size light weight unit light youll attach strap prevent yourself losing display bright readable especially zen plays folder music time stops doesnt keeping playing folder endlessly players playing cd record time set bookmark function exact spot recording included software transferring managing files zen unit straight windows drag drop creative media explorer software rips music cds supposed convert video files play zen couldnt latter function video clips buttons zen little cheap lock button integrated switch accidentally pushing buttons playback zen acts linein recorder 128 160 kbps recording rate builtin microphone sound quality linein decent microphone features worth purchase price zen plays fm radio cant record unit display favorite photos time slide format zen acts portable flash drive function select internal menu decide space data partition concerned unit froze possibly due incompatible music file transferred bit simple correct pin insert unit causes rebuild file list takes minutes doing unit fine paper manual bit skimpy noted online manual sufficient holding button little arrow zen additional options function slightly amusing feature zen messages shutting processing separate window top main window reminds zen computer zen contains calendar clock alarm sounding beep buzz audio player random track fm radio completely shutdown headphones attached arent looking display overall zen plus found constant companion air travel house variety line microphone recording author minds audio books 101 easy steps energy natural", "rating": 4.0, "helpfulNum": 18, "totalNum": 19, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_8/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=8&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3342"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great performance; software a little flaky under Vista", "author": "Nick in Arkansas \"Nick in Arkansas\"", "createDate": "2007-10-18 00:00:00", "fullText": "previous player 30gb nomad couple til dropped twice jogging treadmill killed hard drive player moving zen appealed 4gb linein recording fm radio builtin mic speech recording plus 100 amazon ive month performing expectations sounds fine controls pretty menus ok tiny size compared nomad ive bunch photos contacts information negatives initially tried install win 2000 pc told terms couldnt tried vista pc pretty media explorer application usually locks finish ripping files task manager close media explorer cd info track names weird font strange unreadable symbols despite ripping cds pretty easily theres included app doesnt mess titles ive reboot player time didnt lose songs data 4gb ought 1000 songs 128k sample rate feel little 6000 nomad havent filled 29 wall charger outrageous charging usb fine bought generic usb wall charger ebay 5 doesnt charge unit whats highly recommended os run software", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Zen A Great Little MP3", "author": "Andrea Tiktin-fanti", "createDate": "2007-10-22 00:00:00", "fullText": "am tech saavy owned mp3 player bought zune found record free overdrive audio books library sold loss research found zen wonderful five books recorded visit grandchildren texas carry lots cassettes traveled borrowed library afraid lose convenient figure software bookmarks am improving bought adapter run battery power invention", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great alternative to the iPod market", "author": "Will S.", "createDate": "2007-10-25 00:00:00", "fullText": "player napster subscription simply happier price cd month access release week easily transferred zen plus dont own songs matter month im music switched tired shelf cds listened zen sleek easy organizes music love shuffle features fm radio nice bit harder figure tuning line feature neat idea allows recording play car cassette adapter home stereo cable virtually complaint power adapter included creative products sold ipod finding accessories online tough charging via usb forever adapter micro adapter fine", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "great player, lousy company", "author": "David L. Reber \"former post-tribber\"", "createDate": "2007-10-26 00:00:00", "fullText": "player ruined lousy company player little hard learn soon sept screen dark red discovered labor warranty 90 days customer support 60 days phone lame pay 25 return plus shipping replaced 2gb unit tried call looked charge replied email wouldnt accept email didnt email specific complaints responded form email extended warranty 35 bucks extra 27 paid unit support warranty terrible buy feel lucky", "rating": 1.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Truly Zen", "author": "S. Libby", "createDate": "2007-10-29 00:00:00", "fullText": "ive zen plus little month am loving 8 hrs day easy program music photos movie break times definitly recommend item market video capable mp3 players", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Normal folks will love this thing", "author": "Vincent Purdie", "createDate": "2007-10-31 00:00:00", "fullText": "normal dont hands love update firmware organizer software simple email application handed people hear panasonic makes look", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "First player defective, second works great!", "author": "Kristine A. Thompson \"KAT\"", "createDate": "2007-11-01 00:00:00", "fullText": "product gift hour operation froze indicated future trouble 2 weeks screen burned freeze ups common neoprene protect broke taking time reset player amazon questions sent 2 days flawlessly single freeze player size easily compatible library audiobook downloads 5 stars creative skimpy quality control", "rating": 4.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "The Perfect Portable Music Player", "author": "Kirk A. Gauthier \"Parkas 4 Kids\"", "createDate": "2007-11-02 00:00:00", "fullText": "skeptical buying zen time serious mp3 player holding ipod kept hearing negative feedback coworkers told creatives mp3 players zen love sight play single zen ive talked owns hasnt nice plus series theyre perfect house jog enjoying music etc plus light forget apple power player comes mp3 players creative definitely run money downfall device 4gb wasnt 30gb visionm", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_12/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=12&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3530"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great Gidget", "author": "M. D. Riessen", "createDate": "2007-08-11 00:00:00", "fullText": "mp3 player overall player easy navigation learning curve volume controls outside hassle numerous features players market price play music watch videos upload organizer outlook listen radio record own voice notes im glad chose player", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great little player", "author": "Timothy D. SHELFER \"TDS\"", "createDate": "2007-08-20 00:00:00", "fullText": "switched model 20gb zen sleek step backwards im runner sleek heavy mini hard drive unfortunately runners occasionally drop stuff drive packed cement previously owned sandisk fell apart weeks picked model otherwise liked sleek flash memory instead theres memory 4gb instead 20 else advantage size tiny little unit weighs practically fits phone pouch readable screen sound quality excellent bit larger sleek fm radio reasonably inside office building joystick controls easy manipulate mentioned reviews charging options limited ill eventually buy external charger locked twice zens thats easily fixed reset button paper clip leave carrying pouch overall im satisfied little running buddy", "rating": 4.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Tiny, smooth and extremely portable mp3 video player", "author": "S. Wu", "createDate": "2007-08-22 00:00:00", "fullText": "ive mp3 player 8 months pleasant listen music watch videos pros sound quality crisp video quality surprisingly enjoyable screen extremely protable light tiny scratch free surface bag cons video file takes lot space creative own format cumbersome overall love", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Maybe I just got a bad one...", "author": "Bill Allison \"Bill Allison\"", "createDate": "2007-08-27 00:00:00", "fullText": "love player im fan creative aside zune dont theres ipod alternative zen microphoto numerous drops perfectly belongs brother zen plus expecting pure disappointment started box yeah light im people love sort jogging whatever microphoto little weight solid feel disappointment tried thumb stick slightly cheap feel cool id able live sound quality reason star rating cool look set halfway liked gotten stupid thumb stick thinking actually purchase day scrolling throught menu completely froze caused none buttons respond power day needless little disappointed wont saying creative bad product maybe lemon website player 83 review editors choice award reason decided getting plenty reviewers totally happy anyway bad experience changed opinion company microphoto mp3 players designed zen vision rocks im looking forward newly designed zen im little leary getting zen plus anyway youre considering 4gig player little bit nano shot hang receipt", "rating": 3.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Be careful it's compatiable", "author": "Kimberly Oxley \"shopping connoisseur\"", "createDate": "2007-08-27 00:00:00", "fullText": "bought item tech savy son downloaded software onto computer windows vista windows media player 11 attempts able music product registration wont screen computer removing software sent bought expensive familiar ipod hes ipod dont zen didnt am grateful amazon zen refunded purchase price 5 stars", "rating": 1.0, "helpfulNum": 4, "totalNum": 6, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "a decent little player", "author": "Gabriela Perez \"Oy! So many books. . . .\"", "createDate": "2007-08-28 00:00:00", "fullText": "bought mine special promotion led costing 9 baby cheap overall lot pluses 1 easy eyes ive people commenting neat looking little mp3 player id agree 2 amazon promotion price reasonable 4gb player fm radio note creative zen plus tells radio 3 sound excellent listen classic rock folk set eq own preferences sound outstanding linein capability means record directly cd player drive totally 5 organizer havent am set weekend 6 pretty easy load music audio recordings ive 280 songs fulllength audio book ive left minuses 1 charging hate unless buy special charger charging usb takes time hate hook 2 battery life indicated ads close ive gotten 6 hours charge thats max isnt sad yes 3 god cd comes install using player cd comes programs youll installing charging player remember oh yeah audible program useless current version suffer greatly trying load audio book zen plus unless uninstall install current version zen media explorer program install zencast program yahoo music store program program im dang drag drop sync easily dont install stuff slows computer 4 lack support horrible example clock player freaking display time ahem info guide book programs mentioned website thats hassle sheesh zens clock 6 hours ahead real time ability function tell 5 button located left player lock button slide lock youve locked player slide little bar unlock cant tell times ive unit meaning 6 joystick move thumbs joystick userfriendly probably latter cant possibly thumbs fault bought baby replace sansa 1gb player features sansa nice admit im liking lot spite flaws", "rating": 4.0, "helpfulNum": 8, "totalNum": 9, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "good player, bad shipping", "author": "Spooger \"spoogeface\"", "createDate": "2007-08-29 00:00:00", "fullText": "player overall sound quality features picture video gimmick else music transfer easy gripe received player beat packaging box amazon box containing player beat edge bent shape luckily player safe price buy 60 weekend kinda sucks player price", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "big problems", "author": "Andrew Thoms \"andrew\"", "createDate": "2007-08-29 00:00:00", "fullText": "wife bought zen device liked 3 months weeks headphone jack players shorted tried contact customer service spending hours trying reach internet mail reach customer service person nor automated response help disappointed", "rating": 1.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Neat...but", "author": "Deathwind", "createDate": "2007-08-31 00:00:00", "fullText": "lot mp3 player sometimes electronically challenged instruction book little poor explaining catagory relatively simple install music unit am able manage music installed", "rating": 3.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "All You Need.", "author": "Dolamyt", "createDate": "2007-09-02 00:00:00", "fullText": "agree positive comments player caution little joystick navigate time wear similar product type joystick navigator wore buy money easy", "rating": 4.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_9/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=9&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3531"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "light, easy to use, terrific options...highly recommend", "author": "Brian", "createDate": "2007-09-03 00:00:00", "fullText": "operation menues easy intuitive setup additional features movies radio options fantastic havent tried sound recording ripping audio installing creative software dont software installed skipped free software packages folks mp3s definition recordings frankly unless youre extreme audiophile 128 bits excessive taking space required zen software feature mp3 upload try save lots space dont forget sign podcasting", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Good, but...", "author": "Jorge Perez", "createDate": "2007-09-05 00:00:00", "fullText": "creative players price sound dont navigation joystick fingers little difficult im user player install extra libraries", "rating": 3.0, "helpfulNum": 5, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Love it!!!", "author": "Robin A. Ayers", "createDate": "2007-09-11 00:00:00", "fullText": "happen love mp3 player easy navigate 10 figured reading instructions six hours charge box 2 2 12 hours charge easy transfer songs pictures videos highly recommend looking mp3 player", "rating": 5.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "pay for the 2 year replacement plan -- you'll probably use it", "author": "C. Schmidt", "createDate": "2007-09-12 00:00:00", "fullText": "admittedly frequent display zen plus orange finally disappeared resetting charging effect searching internet found zen plus purchase players hadnt purchased available 2 replacement plan left useless 90day protection coming player purchased zen plus careful purchase replacement plan time tried companys mp3 player compatability overdrive audiobooks available public library im zen sound quality fine slightly tinny slight function original recordings player player started shutdown play resumes beginning track played play stopped precise play stopped fast forwarding previous stop isnt difficult fast forwarding sometimes makes player freeze player reset bookmark function allows play precise previous stop function play stops track continuing track change settings avoid havent researched issue extensively customer reviews suggested resetting difficult ive found resetting easy paperclip pin", "rating": 3.0, "helpfulNum": 5, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Great features, highly recommend ", "author": "deyra", "createDate": "2007-09-18 00:00:00", "fullText": "player excellent features easy read screen bright easy menu system customize commonly commands top menu excellent sound quality includes equalizer set headphones software interface rip cds extremely easy read complaints reviews joystick hard fat fingers agree wife skinny fingers short fat fingers trouble using joystick navigate player height width ipods liked fit ipod bit player jpegs video frozen couple times ive six months hitting reset button paper clip engage btw pen pencil dont fine overall highly recommend player", "rating": 5.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Don't waste your money", "author": "Private", "createDate": "2007-09-21 00:00:00", "fullText": "sadly bought 2 creative zen gifts broke week cool features fm radio voice recorder dang isnt reliable im sorry bought worse hadnt gotten people gifts giving people gifts birthdays", "rating": 1.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "XasPerating", "author": "W. Sandifer \"The Minimalist Boater\"", "createDate": "2007-09-24 00:00:00", "fullText": "nicely fm radio refused laptops using xp tried recommended fixes 10 hours expensive fm radio creative posts couple pages recommended fixes bad sign product carries technical real design maybe bill gates provided technical mine amazon", "rating": 1.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Not  Pleased", "author": "Hugh Murray", "createDate": "2007-09-26 00:00:00", "fullText": "bought product reading reviews ran faced week player froze return replacement country unable return defective time pay am stuck fortunately original started battery flat recharged am hope continues plus sound properly gotten rating bad experience", "rating": 2.0, "helpfulNum": 1, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_10/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=10&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3697"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Does not support folders", "author": "Michael Hwang", "createDate": "2007-09-29 00:00:00", "fullText": "player support browsing folders makes pain bunch mp3s option continue play album finishes goes repeats speed scroll capability firmware zen nano designed ones", "rating": 3.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "First Impressions...", "author": "Ear Candy Junkie", "createDate": "2007-09-30 00:00:00", "fullText": "shiny picture larger zippo logical navigation included buds respectable listening bose remember speakers sound recommend dropping player video camera joystick tiny easy manipulate proper subtle touch avoiding power meant beaten manual describes controls respond promptly software install quick charging wasnt popup window noticed didnt highspeed usb port 5 hours charge time box arrived condition direct amazon charge time allowed familiarize quickstart user guide accompanying cd launching cd looks installing step 34 offers user guide charged able easily navigate zen explorer program autofill library list audio tracks load device groove list arrived songs 15 minutes 25 total storage rocking loading speed tracks clean primary device music photo video possibilities included fm radio performs personalization options onboard personal mp3 free bad radio remote ironic option zen plus attractive sound graphic eq stay tuned", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "This player sucks!", "author": "Chris M. Reed", "createDate": "2007-10-01 00:00:00", "fullText": "buy player rated 5 stars amazon move top list mine lasted 5 months completely reason warranty creative lasts 90 days purchase item warranty 90 days listed bold print times yourself favor try", "rating": 5.0, "helpfulNum": 2, "totalNum": 7, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Be Warned!!", "author": "Dont just exist", "createDate": "2007-10-02 00:00:00", "fullText": "player lasted six months died warned people experience looking lasts try else", "rating": 1.0, "helpfulNum": 1, "totalNum": 3, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "G-R-E-A-T!!!", "author": "S. Kneifl", "createDate": "2007-10-03 00:00:00", "fullText": "looking getting ipod nano searched ipod buying name creative zen buy amazing product amazingly 100 ipod videos fm radio month cant complain highly recommended stop reading buy wont dissapointed", "rating": 5.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "What an overpriced piece of junk - it worked for less than an hour", "author": "Jeanie M. Winstrom", "createDate": "2007-10-06 00:00:00", "fullText": "read reviews deal research choosing apple product husband technical people died hour night spent hours online tech support help forums avail complete waste time money dell american express thanks dells policy am 100 worth am returning items reason am writing review gateway laptop dell stink apple baby ipod box failed airplanes vacation worn motorcycle trips duration little matter running dropped times live learn dell purchases lesson learned passed", "rating": 1.0, "helpfulNum": 2, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative Zen V Plus 4 GB MP3 Player", "author": "J. Williams \"profanatic\"", "createDate": "2007-10-10 00:00:00", "fullText": "creative zen plus 4gb mp3 player awesome product sounds plays excellant car nice fm radio reception compact easy suggest buying skin protect finger prints ear phones comfortable fall protective screen shield skin nice idea air trapped mp3 screen protective screen nasty air bubbles cant rid suggest product quality price", "rating": 5.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Mixed Feelings", "author": "Snuffie \"Tina\"", "createDate": "2007-10-16 00:00:00", "fullText": "purchased player zen died headphone jack useless able listen player joke belive size getting size worries programs dont music player am thankful dad transfer music folders player otherwise music zen easy music disappointed bought stuck didnt damaged left tried main menu pause songs own 4gb reason cant 100 songs player letters artist files tells system add 1 song 100 purchased player didnt splurge ipod usually player mixed feelings loved size joystick loved black appearance loved add photos background feature love styles player battery life 6 hours charge takes time freezing player wish player overall mixed feelings im try music cant tracks im rely else love creative products thats bought cant im middle", "rating": 3.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_pr_link_11/002-0917478-0089613?%5Fencoding=UTF8&pageNumber=11&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3698"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Don't Buy This!", "author": "J.S. \"Jim111\"", "createDate": "2006-10-12 00:00:00", "fullText": "update player freezes sound screen displaying album artwork random times apparent reason units reset times reset feels internal pad press sharp pin disappeared broken recourse wait 3 days battery run dead hope reset simply recharging scratch weve unit august december feel reliability level product sufficient justify purchase buy else doesnt reset time bought 2 gb model 4 gb version wasnt available largest flash memory unit napstertogo subscription store largest songs color photographs 4 gb version identical except amount installed flash memory plus version sports fm tuner ability display videos bonus choose flash memory based mp3 player napstertogo compatible hard drive models larger storage capacity abound figure theyll break prematurely hard drive cant withstand jogging accidental bumping dropping bought players plus separately sold ac wall charger attached wall charger 6 hours attached usb port pc charge 6 hours 6 hours unit attached pc fine unplugged comatose revive reset button pushed times exchange replacement unit days buying unit attached wall charger fine load music using napstertogo subscription fine 2 weeks wife charged pc using usb cable charging disconnecting pc comatose time able revive pushing reset button look unit charging ac wall charger gone comatose able revive pushing reset button reset button inside tiny hole left edge unit following thin groove thats below screen left edge unit youll picture manual accurately depict location hole leading reset button instructions penetrate hole pin sharp safety pin pin inserted easy miss reset button unless pin inserted exactly angle youll angle dont feel youre pushing pad spring reset unit pad travels short distance stopped control surface inside unit thats reset reset system redesigned doesnt depend angle insert pin suspect unit returned reset insert pin angle didnt attempts reset successful resetting unit akin rebooting pc revives internal software called firmware frozen restarting software erase songs photos mistake mp3 player looks feels beautifully firmware newly designed appears bugs relating disconnecting usb charger power cause freeze reset button little hard dont described cause unable reset unit thats frozen able reset little user friendly hopefully future firmware update available lower occurrence unit locking freezing especially disconnecting usb port ac charger recharging user noted safe disconnect icon times system tray dont subscribe napstertogo options content mp3 player transfer favorite songs cds own hard disk ripping songs purchase songs track album time price ranging 88 99 cents song napster rhapsody walmart download books listen sellers classics podcasts favorite newspapers read aloud favorite radio programs npr plethora sites netlibrary audible available onto computers hard drive listen music audible books podcasts pc loudspeakers sitting pc transfer songs audible books podcasts hard drive pc mp3 players enables mp3 player enjoy listening car office jogging gym shopping pool beach hear music audible books podcasts", "rating": 4.0, "helpfulNum": 76, "totalNum": 89, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "REVISED: this mp3 player makes little sense, functions are IMPRACTICAL, MAJOR HASSLES. 1 STAR.", "author": "E. Kim \"what a decadent time...\"", "createDate": "2006-10-15 00:00:00", "fullText": "recently purchased item owned day list type features look bad mp3 device below player frozen reset successful background info ive owned 7 mp3 players 2001 including zen plus 4gb looking simple mp3 player seamlessly interface computer via windows explorer spectacular audio quality cool features voice recorder fm radio strongly prefer install proprietary software included mp3 players purchase simplicity simple draganddrop folder mp3 players music folder vice versa replace iaudio u2 1gb mp3 player excellent player aspects found real advantage player prior capacity 4gb vs 1gb bad below 1 capacity storage type player holds 4gb flash memory typically mean consumes battery life resulting hours music enjoyment due storage type 4gb usually acceptable holding 800 1000 songs box advertises 2000 songs false advertising unless songs stop reading review 2 physical dimensions controls players size shape excellent welldesigned sharp corners compact feels fairly robust easy manage volume controls navigational responsive 3 sound quality audiophiles mp3 player sound quality expect company creative digital audio technology days original sound card 4 display features display lit information features fm radio voice recorder etc bad 1 file management mp3 player zen microphoto 8gb initially connected pc hopes able windows explorer manage mp3 files limiting wasnt able play mp3s zen plus via pc application winamp arent arranged filename album title copying files takes extremely especially deleting words forced proprietary software 2 transfer speeds transfer speeds mp3 player abysmal 25 minutes transfer 2 gigs audio files 3 bundled software adequate 4 recharging battery life takes 6 hours recharge battery 6 hours previous iaudio mp3 player charging via usb hour charge seriously 6 hours charge mp3 player battery life 20 hours 5 playing files unless create custom playlists songs play alphabetical album artist creatives engineers thinking conclusion mp3 player terms sound navigation features satisfy users sturdy looks nice file transfer speeds slow file management via windows explorer creative software poor time recharge battery type likes add music twice week mp3 player transfer files quickly easily spend time mp3 player connected pc recharging looking using maybe iaudio comes 8gb flashbased mp3 player addon review hi add notes review manual warning reads cords included product contain california cause defects harm wash hands handling guess youre avoid altogether deter purchasing mp3 player cant delete directly using mp3 player delete connected pc mp3 player menu remove option remove list file occupy space mp3 player creative software indicates files removed files arent middle audio file pause walk minutes conserve battery life shutdown idle time configured mp3 file doesnt resume paused start beginning major particularly listen podcasts audio tracks menu mode accidently voice radio linein record mode stop audio youll start beginning chances return product 999 bring review 15 stars", "rating": 3.0, "helpfulNum": 40, "totalNum": 63, "commentNum": 8, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Small,sleek, not too cute, not too dull...", "author": "Erkin S. Peksoz \"manylander\"", "createDate": "2006-11-07 00:00:00", "fullText": "summary picked zen plus fm radio voice recorder scratch resistant cool design drag drop capability music stores easy quick navigation previous positive experience detailed comparison sandisk sansa series continue reading scroll stop doing whatever creative product zen nano plus indeed ive decided color menu am digital mp3 players 5 starting 32mb rca terrible 128mb samsung hd based dell 6gb apple minis ones hard drive died clickwheel zen nano plus excellent cool 4 gb zen deciding zen serious considerations 1 ipod nano 4gb 6gb loved look price ipod nano previous experience required itunes software pain neck using own mp3s itunes songs music stores products plus fm voice recording admit pretty cool features sansa e250 4gb e270 6gb favourite actually store physically feeling sandisk lead flash card memory manufacturer memories lowest price consider seriously voice recording fm radio options dreaded mandatory music software bigger screen 18 inches zen plus 15 inches sandisk eliminated easy hard clickwheel hands am 62 total forget wheel surface little accidentally hit buttons trying operate size design sandisk looks fatter slick ipod nano compact feel zen line bigger bulkier based total screen gadget stick menu previous current ipods screen 3 inches cheaper equipped features zen plus bigger screen comparable battery life sandisk sansa eliminated month zen plus 4gb pros size look feel optional easy creative software 100 drag drop compatible vibrant colors easy navigate menu easy joystick buttons except below cons decent battery life fm receiver price cons hard screen curse direct sunlight charging usb supplied cable takes forever placement button left playpause button below unit palm unless thumb hard press button screen video viewing video playback seamless vibrant size video capability deciding factor inclined", "rating": 5.0, "helpfulNum": 248, "totalNum": 249, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Not Ready for Prime Time?", "author": "J.S. \"Jim111\"", "createDate": "2006-11-13 00:00:00", "fullText": "bought 2 gb model 4 gb version wasnt available largest flash memory unit napstertogo subscription store largest songs color photographs plus version sports fm tuner ability display videos bonus choose flash memory based mp3 player napstertogo compatible hard drive models larger storage capacity abound figure theyll break prematurely hard drive cant withstand jogging accidental bumping dropping bought players plus separately sold ac wall charger attached wall charger 6 hours attached usb port pc charge 6 hours 6 hours unit attached pc fine unplugged comatose revive reset button pushed times exchange replacement unit days buying unit attached wall charger fine load music using napstertogo subscription fine 2 weeks wife charged pc using usb cable charging disconnecting pc comatose time able revive pushing reset button look unit charging ac wall charger gone comatose able revive pushing reset button reset button inside tiny hole left edge unit following thin groove thats below screen left edge unit youll picture manual accurately depict location hole leading reset button instructions penetrate hole pin sharp safety pin pin inserted easy miss reset button unless pin inserted exactly angle youll angle dont feel youre pushing pad spring reset unit pad travels short distance stopped control surface inside unit thats reset reset system redesigned doesnt depend angle insert pin suspect unit returned reset insert pin angle didnt attempts reset successful resetting unit akin rebooting pc revives internal software called firmware frozen restarting software erase songs photos mistake mp3 player looks feels beautifully firmware newly designed appears bugs relating disconnecting usb charger power cause freeze reset button little hard dont described cause unable reset unit thats frozen able reset little user friendly hopefully future firmware update available lower occurrence unit locking freezing especially disconnecting usb port ac charger recharging user noted safe disconnect icon times system tray dont subscribe napstertogo options content mp3 player transfer favorite songs cds own hard disk ripping songs purchase songs track album time price ranging 88 99 cents song napster rhapsody walmart download books listen sellers classics podcasts favorite newspapers read aloud favorite radio programs npr plethora sites netlibrary audible available onto computers hard drive listen music audible books podcasts pc loudspeakers sitting pc transfer songs audible books podcasts hard drive pc mp3 players enables mp3 player enjoy listening car office jogging gym shopping pool beach hear music audible books podcasts", "rating": 4.0, "helpfulNum": 4, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Nice player...almost perfect.", "author": "B H", "createDate": "2006-11-14 00:00:00", "fullText": "bought player month ago nanos buy played itunes week confirmed ipod wasnt amazon creative comparable nano found zen plus found mini disc player video dont sonys drm rip wma transfer 10x faster sony mp3 player mini disc drop drag kept returning sound mp3 player video sucks palm pilot video files compress file sizes playback zen file takes palm pilot takes zen short video screen pretty darn agree reviews plus mention songs time alot songs zen listen listen unlike players switch zen improved zen doesnt scratch ding players own player doesnt havent hour battery life 6 hour charge time sony devices charge 23 hours hours single charge zen short device highly recomend unit", "rating": 4.0, "helpfulNum": 11, "totalNum": 11, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Not Ready for Prime Time?", "author": "J.S. \"Jim111\"", "createDate": "2006-11-16 00:00:00", "fullText": "bought 2 gb model 4 gb version wasnt available largest flash memory unit napstertogo subscription store largest songs color photographs 4 gb version identical except amount installed flash memory choose flash memory based mp3 player napstertogo compatible hard drive models larger storage capacity abound figure theyll break prematurely hard drive cant withstand jogging accidental bumping dropping bought players plus separately sold ac wall charger attached wall charger 6 hours attached usb port pc charge 6 hours 6 hours unit attached pc fine unplugged comatose revive reset button pushed times exchange replacement unit days buying unit attached wall charger fine load music using napstertogo subscription fine 2 weeks wife charged pc using usb cable charging disconnecting pc comatose time able revive pushing reset button look unit charging ac wall charger gone comatose able revive pushing reset button reset button inside tiny hole left edge unit following thin groove thats below screen left edge unit youll picture manual accurately depict location hole leading reset button instructions penetrate hole pin sharp safety pin pin inserted easy miss reset button unless pin inserted exactly angle youll angle dont feel youre pushing pad spring reset unit pad travels short distance stopped control surface inside unit thats reset reset system redesigned doesnt depend angle insert pin suspect unit returned reset insert pin angle didnt attempts reset successful resetting unit akin rebooting pc revives internal software called firmware frozen restarting software erase songs photos mistake mp3 player looks feels beautifully firmware newly designed appears bugs relating disconnecting usb charger power cause freeze reset button little hard dont described cause unable reset unit thats frozen able reset little user friendly hopefully future firmware update available lower occurrence unit locking freezing especially disconnecting usb port ac charger recharging user noted safe disconnect icon times system tray dont subscribe napstertogo options content mp3 player transfer favorite songs cds own hard disk ripping songs purchase songs track album time price ranging 88 99 cents song napster rhapsody walmart download books listen sellers classics podcasts favorite newspapers read aloud favorite radio programs npr plethora sites netlibrary audible available onto computers hard drive listen music audible books podcasts pc loudspeakers sitting pc transfer songs audible books podcasts hard drive pc mp3 players enables mp3 player enjoy listening car office jogging gym shopping pool beach hear music audible books podcasts", "rating": 4.0, "helpfulNum": 1, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Creative products are the best out there", "author": "Erin Dougherty \"MusicChick11233\"", "createDate": "2006-11-27 00:00:00", "fullText": "originally purchased ipod nano day numerous exchanged creative zen plus couldnt happier mp3 player creative decided buy lots accessories ipod ipod waste money whereas creative zen plus offer lesser price stick creative dont disappointed", "rating": 5.0, "helpfulNum": 12, "totalNum": 13, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Tiny, tough and almost perfect", "author": "R. Cox", "createDate": "2006-12-13 00:00:00", "fullText": "player deserves 4 12 stars bought replace sansa e260 returned disappointing sound quality zen plus disappoint sound quality excellent bass volume noticeable system noise playback form factor zen terrific tiny size curved shape comfortable hold hand slip pocket despite construction zen stand abuse ive found scratch easily previous player result scratchresistant polymer coating plan player running camping gym etc dont feel ill baby interface youd expect creative simple intuitive powerful options customizing including choosing main menu options display setting photos wallpaper rotating display orientation corresponding controls increments dont strain neck read display player strapped arm feel creative spent time figuring real users player despite size joystick easy combination interface course zen plus features care depending fm radio 32 presets voice recorder pim functionality sync calendar contacts tasks ms outlook negatives zen plus battery life 15 hours lot eq low scale compared players plan taking trips suggest getting ac wall charger hint charger zen micro fine unit drawback oled screen lower resolution lcd screens difficult bright sunlight hand youre buying primarily music player multimedia device screen adequate vibrant colors pop decent job photos disappointed device true ums partition memory storage run win xp am sole user device mtp player deal music organized folders drag drop onto player using creatives media explorer note sansa players zen id3 tags categorize music display file properties pays tags cleaned correct excellent sound system noise convenient size form factor simple powerful interface screen battery life", "rating": 4.0, "helpfulNum": 21, "totalNum": 21, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}, {"productName": "Creative Zen V Plus 4 GB Portable Media Player (Black/Blue)", "title": "Frustrating launch- A+ after it is connected", "author": "J. STANLEY", "createDate": "2006-12-25 00:00:00", "fullText": "am updating review 4 star product fits talk computer creative support solution walked issues xp usb hours eventually product daughter thrilled original christmas day review christmas gift daughter software communicate zen own zen micro enjoyed zen plus wont talk computer following installation instructions explicitly web site support help hours wasted save time money product", "rating": 1.0, "helpfulNum": 5, "totalNum": 10, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000IBNXX2/ref=cm_cr_dp_all_summary/105-6217302-9378868?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/543"}]