[{"productName": "Sony NW-A1200 8 GB HDD Digital Music Player (Pink)", "title": "...a technological NIGHTMARE! updates, firmwares, more firmwares, more updates, fixes... Ugh!!!", "author": "Paulo Leite", "createDate": "2006-12-03 00:00:00", "fullText": "bought brother try maybe ill buy mistake popped cd computer installation connect software software load unit mp3 files tried strange messages kept appearing saying failure softwares elements tried product support link installation cd discovered incredible array additional fixes firmwares technological mistakes supposed download instal alternate software previous journey complicated sweet tried computer ill returning unit getting actually ill forget happened player player comes demo songs songs succeeded playing sounded player sound software bad", "rating": 1.0, "helpfulNum": 1, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000GIUPM4/ref=cm_cr_dp_all_summary/105-6702530-5922038?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/486"}, {"productName": "Sony NW-A1200 8 GB HDD Digital Music Player (Pink)", "title": "Nice little player", "author": "A. Lonzrick", "createDate": "2007-03-06 00:00:00", "fullText": "purchsed item owned sony 512 mb player recieved player days kudos amazon providing service sonic stage 30 installed computer upgraded 40 version included player breeze sony estimated 2030 minute load time loaded running 10 read numerous reviews sonic stage horrible software impossible download songs found sonys promptly credited account error player pretty cool design especially display screen allows download own playlists directly sonic stage build own directly player holds fair amount songs 5000 sound quality youd expect sony menus easy navigate player fit pocket heavier cell phone solidly device accessories speakers fm transmitters ipod nice little setup device overly complicated solid hardware worse", "rating": 4.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000GIUPM4/ref=cm_cr_dp_all_summary/105-6702530-5922038?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/486"}, {"productName": "Sony NW-A1200 8 GB HDD Digital Music Player (Pink)", "title": "Very Good feminine look player", "author": "Marwan Hamdy A. Ezzat", "createDate": "2007-05-16 00:00:00", "fullText": "nice mp3 player touch plays mp3s nice sound quality takes gifts gf nice look color innovative display compact size supports playlists album genre etc times recognise mp3 files faced simply convert wma conversion tool mp3 loss quality recommend", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000GIUPM4/ref=cm_cr_dp_all_summary/105-6702530-5922038?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/4860"}]