[{"reviewId": "3290", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Excellent video player", "author": "Dr. Senaka Rajapakse \"Senaka\"", "createDate": "2007-01-04 00:00:00", "fullText": "archos 604 30gb fantastic video quality amazing dvd quality supports divx mentioned literature audio quality earpieces comfortable pity didnt usb input note recording buy optional dvr station 100 downloading movies stuff quick media player quirks times battery life audio video 2 hours player bulky ideal carrying pocket invest proper leather supplied pathetic", "rating": 5.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3291", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "The perfect multimedia viewer!", "author": "Rich", "createDate": "2007-01-04 00:00:00", "fullText": "im archos player beat widescreen huge compared 22 inch screen controls simple intuitive kickstand improvement allows unit sit 15 degree angle watch movies hands free user replacable battery extra ones excellent photo viewer nonproprietary file formats locked format videos built speaker microphone earbuds dont fit peoples ears supplied ones buy pair fit ears sony makes pretty inexpensive set supplied dog nylon sack offers protection thats try wont sorry", "rating": 5.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3292", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "I love it. (repeat 3 times)", "author": "C. Panno", "createDate": "2007-01-04 00:00:00", "fullText": "solid product satisfied lot research internet purchasing able play instore purchase sharper image tried devices size reputation archos quality feel unit options glowing reviews ability transfer photos digital camera experience easy screen performance construction feels solid looks bought plugins helmet cam flawlessly tech support called questions plugins purchased 5 min wait helpful money spent expectations product delivered regrets couldnt pleased", "rating": 5.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3293", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "It's a great little video player", "author": "Mike Bagstad", "createDate": "2007-01-04 00:00:00", "fullText": "bought 604 recording video odd roller instance disappointed becasue doesnt native video buy cam adapter archos unit september helmet cam helmet cam av500 series neither adapter camera available time waiting newly available travel adapter december finally arrived yesterday am frustrated arrive wonderfully hooked external camera camera own power connected tv video source 4 months nicely yes plays videos ive downloaded job mp3 player hey thats ipods concern live fear breaking nice screen pocket pack using field hard nice itd fit travel adapter useful oh gripe couldnt included input jack unit video travel adapter finally youve money buy mike", "rating": 5.0, "helpfulNum": 1, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3294", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Excellent Product", "author": "Jeff E. Holcombe \"computer veteran\"", "createDate": "2007-01-07 00:00:00", "fullText": "reading numerous reviews searching month finally decided archos product line absolute bang buck hands wont bad devices category device none compare features support quality product screen menu system ive found comes ones models range actually contact support downloading additional plugins web site received help plugin installed 5 minutes fast helpful support team feature price vs record feature nice im folks ability buy change mind nice bought wife birthday enjoyed immensely device absolute picture viewing ability zoomed thumbnails roll etc mainly buy device archos product supports highly recommend buy additional plugins worth change functionality device nice incorporate device purchase cheap fine", "rating": 5.0, "helpfulNum": 4, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3295", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604", "author": "K. R. Bashta \"Randall Bashta\"", "createDate": "2007-01-08 00:00:00", "fullText": "moment pick archos 604 box look feel quality product accounts brilliant 43 inch screen class bought pmp 604 connect easily pc transfer videos music photos quick easy spend moments website instruction manual figure couple day buttons allinall personal media player perfect world screen tad brighter audio output little stronger am crazy website pay firmware updates little nice features pmp tend overlook short falls archos 604 nice piece equipment perfect traveling home office", "rating": 4.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3296", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "The best of the Best!", "author": "Trevor Waldron", "createDate": "2007-01-09 00:00:00", "fullText": "buy player spent month looking review spec pvp mp3 player disappointed charging usb cord bought 30 charger amazon charge outlet resolution beyond stores video vacation screw wifi model buy", "rating": 5.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3297", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Good for the money", "author": "Michael Wilson", "createDate": "2007-01-09 00:00:00", "fullText": "device viewer pictures movie downloads bit complicated tried click drag windows media didnt files device files separate dont integrate easy buy 100 usd archos docking cradle record dish vcr dvd tv slim fits pocket resolution viewing fairly simple learn picture files easy download scrolling picture viewer 3d flip fade carry business files overall technology fairly", "rating": 4.0, "helpfulNum": 0, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3298", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604", "author": "T. Porter", "createDate": "2007-01-10 00:00:00", "fullText": "incredible device watching pc reviewed 604 recently decided item blows lcd player 43 169 lcd truly amazing reads pdfs plays music holds photos sports recorder dvr plays avi box paid 20 mpeg 4 vob support plays dvds folders device amazon cheapest 30 shipped fast arrived perfect shop", "rating": 5.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3299", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "One serious little toy", "author": "Skyline", "createDate": "2007-01-16 00:00:00", "fullText": "moment online sons christmas disappointed battery life operation reasonably easy feature set beautiful screen impressive obvious feeling quality light feather tiny pay extra video drivers user interface isnt perfect job anticipate happy 604 time", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_2/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1386"}, {"reviewId": "3300", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Dude, Sweeet!", "author": "Kipp \"Dutchez of Good Deeds\"", "createDate": "2007-10-05 00:00:00", "fullText": "product absolutely ive recently bought archos month am enjoying inch mentioned reviews pay movies im fan questionable view movies id watch movie sex im recording movies archos movie makers call jump cuts pause recording scene movie comes dont care viewing resume recording finally watch movie contents didnt wont cool archos doesnt hurt pockets mentioned reasonably priced unlike ipod funny cause time buy media player mp3 player compare ipods measure buy ipod price music videos pictures archos movies tv music photos digital camera connection capability pdf capability favorite audio recording favorite tv playback dvr dock station dvr travel dock steal didnt archos 604 wasnt rid purchase buttons dont light hard navigate night happen dark remedied buying archos touch screens didnt fm feature couldnt hurt compared archos zen creative theyre buys archos dont people dont opposed ipod appears im ipod im theyre buy", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_6/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1387"}, {"reviewId": "3301", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Get the dock", "author": "Norman A. Garrett", "createDate": "2007-10-31 00:00:00", "fullText": "purchased unit amazon primarily travel trip choose movies pop movie dvd player record archos screen nice people sitting airplanes months observations 1 dock opinion included record directly dvd player dvr recorded programs dish network dvr played recording archos 2 airplane audio low blast unless noise canceling headphones tried earbuds hardly hear movies bose headphones experience archos airplane 3 subscribed urge subscription music windows media player 11 subscription music fine downloaded lots subscription music archos sync month drm dates updated wmp automatically alas urge merged rhapsody weeks ago guess rhapsody compatible archos neither napster subscription music player isnt obviously purchased music cd rips fine 4 manage files deleting files hard drive easy havent found delete folders example easily delete individual songs album theres menu delete album little quirks using getting 5 little similar devices havent found am walking running mp3 player video travel cant beat overall consider purchase love unit bought extra battery video sucks battery pretty watch 2 fulllength movies battery dies dock highly recommend purchases unit course adds overall price mind comparing functionality", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_6/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1387"}, {"reviewId": "3302", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Great for watching movies, not so much for audio on the go.", "author": "Ezra Hoover \"tech lover\"", "createDate": "2007-11-30 00:00:00", "fullText": "ive archos 604 30gb 2 months ive using practically day fantastic pvp comes watching videos screen size sweet spot zen vision tend eye strain motion bigger heavy anyway major pros cons pros screen resolution size contrast videos looking compared friends zen vision resolution bit sharper archos viewing angle superior audio quality audio enhancements eq bass boost included nice option mass storage device win media device fantastic base price mine steal 180 refurbished cons silly button layout takes getting requires hands support device push buttons operate difficult operate blindly ok honest plain ugly compared slick zen ipod product lines limited video format support box purchase upgrade 20 nagging con delicate spinning physical hard drive touchy frustration slightest tap bump device reading drive cause lock remove battery press reset button object dont lose data except time date admit feel pretty darn silly device resetting train street walking etc etc honestly crashed 40 50 times past 2 months im crashes destroy drive eventually bottom line listen music stuff included size book ready lots hard disk lockups load baby tv episodes movies nice comfy sit archos 604 screen adequate battery life 4 hrs shines", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_6/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=6&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1387"}, {"reviewId": "8505", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604", "author": "J. Hendy", "createDate": "2007-01-19 00:00:00", "fullText": "am happy archos 604 product lives hype recommend consider depending device wifi version users prefer final comment battery life battery life exceeded expectations", "rating": 5.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8506", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604 is perfect for video on the go", "author": "M. Delaney", "createDate": "2007-01-19 00:00:00", "fullText": "buying product actually looking didnt record content view tv archos 604 docking station ability record view tv portability drew combo price excellent price functionality portability regular dvr run 20000 30000 throughly enjoy archos 604 didnt 5 stars becasue expected playback quality little viewing tv mention am using composite video audio outputs component output attached 40 sony hdtv correct tweaking settings using component video im viewing unit crystal", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8507", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "So Far...I love it!", "author": "BobDes", "createDate": "2007-01-24 00:00:00", "fullText": "unit nice heft feel cheap toy size bit pants pocket fit picture video quality perfect films lag bit smooth easy instructions soon nature navigate files loaded easy dragndrop feature photo viewer slideshow nice negatives sound horribly low volume earphones buy external speaker buy couple bucks play vob files download cinema plugin 1999 archos web page easy install setup dont understand wasnt program start cheesy overall love watch tv unit havent recieved tv dock cant comment am enjoying", "rating": 5.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8508", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Keep Your Receipt!", "author": "Heidi Slade", "createDate": "2007-02-02 00:00:00", "fullText": "archos 604 package january 11th 2007 machine sleek sexy protective cover didnt bubbles kept exciting read reviews remained cautious kept packaging archos simply terrible customer service prepared charge 2 hours instructions loaded music photos videos charm loved pdf viewer ebook taking favorite books heck companion guide ten date february 2 2007 ive archos month simply doesnt battery charged according directions installed firmware exhausted troubleshooting forums google hope archos shuts five didnt score 1 heres list pros cons pros 43 inch scratch resistant screen viewing angle ultra battery life headphones package sound own volume control exterior sexy actually fit pocket cons obviously doesnt archos terrible customer service navigation intuitive documentation lacking buy accessories access devices potential fm radio overall stopped loved device risk risk receipt packaging review return policy associated device matter buy", "rating": 3.0, "helpfulNum": 2, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8509", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604", "author": "S. Badger", "createDate": "2007-02-02 00:00:00", "fullText": "pmp awesome transfered 25 movies encoded xvid 400 mp3s 5 gigabytes worth digital pictures 8 gb free buttons interface navigation easy bought battery charger battery battery charger pretty hard charge road unless access usb port screen beautiful movies 604 look 7 inch portable dvd player plus portable", "rating": 5.0, "helpfulNum": 3, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8510", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Windows, step down. This OS is worse. More bugs than a jungle.", "author": "C. Dickerson", "createDate": "2007-02-16 00:00:00", "fullText": "am incredibly upset purchase archos 604 box center rocked supposed month purchase ugly cut product horrible suffering malfunction invent ive corrupt files blow brains whatever reason device likes shut middle transferring computer impossible song album ah worse sudden freezes clue takes forever load songs hard drive takes forever song hard drive slows try file 3000 songs takes forever horrible buttons half time press wrong button song cant hard drive load drives absolutely crazy besides horrible layout buttons speaker worthless crank volume speaker horrible mess noise clarity screen fantastic makes images look crystal hd videos look hdtv actually play videos maybe dud havent tried contacting archos asap stay product bought dvr station cool perfect actual archos im pleased purchase hope refund", "rating": 2.0, "helpfulNum": 2, "totalNum": 5, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8511", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604 - 30GB Rocks!", "author": "J. Kinder", "createDate": "2007-02-17 00:00:00", "fullText": "slick easy plane flight started listening loaded music switched recorded tv night onto movie loaded soon heard pilot gate explaining couple fun sharing stored photos screen sound suggest buying head phones enhance quality 5 stars", "rating": 5.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8512", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Returned because of major issues with PlaysForSure media", "author": "Henry J. Sokolowski", "createDate": "2007-02-17 00:00:00", "fullText": "note updated review serious earlier amazon allow reviewers change reviews star downgrade rating agree positive reviews reviewers screen bright interface intuitive features bought player encountered issue plug usb cable select connect windows media device click ok napster tried view files device crashed rebooted archos logo called tech support helpful answer minutes cause archos support windows media player 11 require downgrade wmp 10 plan address issue future firmware upgrade wmp 10 solved called defective product returned exists napster player listen music watch videos device useless returned refund bought creative zen vision instead shame player market archos resolve software issues bugs player worth purchasing", "rating": 3.0, "helpfulNum": 5, "totalNum": 6, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8513", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Cool device, but connectivity problems ", "author": "G. Thurau", "createDate": "2007-02-18 00:00:00", "fullText": "bought archos 600 picture video viewing sharing ability screen portability ideal share photos videos friends family device didnt disappoint coolness factor sleek design easy navigation opinion quickly changed ran connectivity days using able download synchronize via windows media player easily couple times device sudden wasnt recognized usb device anymore froze external hardware management function pc connect using simply external hard drive customer service archos able help driver issues pc logic fine warning stops frustrating experience lines reviewer experienced isolated", "rating": 2.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8514", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "100 stars", "author": "ordinaryman \"me\"", "createDate": "2007-02-18 00:00:00", "fullText": "dont reviews windows media player love connect pc hard drive add files maybe thats mine doesnt crash anyway screen little plasma tv exaggerating hard drive space record movies dvd player optional dvr station 70 dollars walmart dvd 5 gigs recorded archos 1 gig 90 minute movie recording tv thinking buying ipod video highly suggest looking archos bad pay extra dvr function protective bag comes useless charges usb unless dvr station speaker trash buy add speakers thats else play video format avi download plugins website charge 20 dollars itbut smart download free video converter net convert avi record dvr station automatically converts avi hands getting tired please dont negative reviews crashing windows media player stop getting dont media player sync files drag drop regular hard drive bought", "rating": 5.0, "helpfulNum": 7, "totalNum": 8, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_3/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1920"}, {"reviewId": "8515", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Excellent Product. Would Recommend with some suggestions for ARCHOS", "author": "Hew Zane \"Likes to Travel\"", "createDate": "2007-06-27 00:00:00", "fullText": "own tech device planet wife travel decided pick archos 604 able watch favorite airport pictures portable media player online justice box surprised sleek cool looked hands wide screen awesome compared ipod zune surprised sound earphones prior buying archos read reviews soft sound hard listen airport beg sound picture phenomenal especially volume control ear pieces line convenient reason rate product 5 star offered consumer separately buy dvr docking station buy plug ins play podcasts device awesome optional accessories archos makes inconvenient consumer dont include nice package am type consumer likes ready box overall winner combined amazon movie downloads multi functionality archos makes device vacations plays music digital camera pictures videos able record live tv dvds read reviews difficulty using graphic user interface difficult time people using navigation toggle dont wrong am easily able navigate controls easy ipod zune functional dont bringing movies music photos archos wife am seriously thinking putting ipod buying archos recommend portable media player market time", "rating": 4.0, "helpfulNum": 5, "totalNum": 6, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_5/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1921"}, {"reviewId": "8516", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Couldn't Have Choosen Better", "author": "tonitiger79", "createDate": "2007-07-12 00:00:00", "fullText": "homework choosing device im glad time jumped digital age brief moment considered buying video ipod quickly learned archos buff reviews archos 604 stand true im tech savy person easy time utilizing features toy theres software install plug usb cord user friendly buttons intuitive draganddrop capability makes simple copy files pc navigating menus snap lcd screen beautiful picture crisp crystal outdoors external speaker nice feature lot pmps dont offer sound okay headphones offer quality volume control cord awesome buy storage pleased wasnt pouch hated replaced device holds securely leaving headphone jack exposed easy access havent purchased dvr docking station im excited test overall highly recommend device worth price fan whos", "rating": 5.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_5/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1921"}, {"reviewId": "8517", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "10 Stars!", "author": "D. DeKeyser \"dekeyser4\"", "createDate": "2007-08-07 00:00:00", "fullText": "product 10 stars ive unit 4 months absolutely complaints love love love riding train tv time 12 hours waiting sun pull archos watch tv movie drag drop tunes files onto hd itunes manage stuff plays formats love purchases ive id buy buyers pick 605 sept little resolution im fan pick", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_5/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1921"}, {"reviewId": "8518", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Disappointed", "author": "Ellen P. Hunt", "createDate": "2007-08-13 00:00:00", "fullText": "functionally product pretty sweet plays videos image looks cinema plugin play broadcasts recorded pc bought camera recording feature recording videos stopped playing music video connect computer recharge send serviced customer support frustrating web interface wouldnt bother info email success calling toll free waiting live customer support person anyhow unit reformatted expected lost gig ripped music bad didnt backup changed internal product key firmware version serial 30 cinema plugin purchased installed doesnt hello thinking youre charge addons reinstall enable reinstall sent email customer support happens cant reduce rating 1 star somewhat responsive maybe ill bump 3 id recommend product theyve spread themselves thin trying bugs products support procedures maybe theyll eventually", "rating": 2.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_5/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1921"}, {"reviewId": "8519", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Great personal media player", "author": "S. Johnson", "createDate": "2007-08-15 00:00:00", "fullText": "personal media player ive play movies mp3 music podcasts sound quality top notch video quality beyond looking personal media player cant wrong archos nice feature unit external usb20 hard drive thumb drive carry key files", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_5/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1921"}, {"reviewId": "8520", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Excellent Video, Poor Audio", "author": "Jose R. Guevara", "createDate": "2007-08-16 00:00:00", "fullText": "video display excellent seen 45 degrees angle excellent recording able record movies technical unit personal experience 30 gb unit hold 15 length 2 hour movies negative comment poor audio plane trip disappointed heed someones advise buy noise cancelling earphone earplug type useless audio home movies plan recording movies buy else base station transfer photos music home movies consider unit useless base station product highly recommended dont forget buy noise cancelling earphones plane trips enjoy videos", "rating": 4.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_5/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1921"}, {"reviewId": "8521", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Not an iPod Rival", "author": "M. G. Chisholm \"chiefengineer3\"", "createDate": "2007-08-19 00:00:00", "fullText": "ipod archos staying battle own portable media center opposed pocket music player honest looking listen head pick creative zen ipod travel lot stuck airports haul flights video quality excellent screen tiring play pretty buy plug record mpeg4 doesnt issue bought optional dvr station unit bunch flexibility worth cost bought additional battery deal haul flight ten hours video note dont live usa choose record play pal ntsc wish makes pretty flexible bit gear price value dont knock zen occasion guess shouldnt dropped buy honest supplied advantage allow player stand viewing angle totally flexible media player recorder package", "rating": 5.0, "helpfulNum": 0, "totalNum": 0, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_5/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=5&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1921"}, {"reviewId": "12563", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "4 1/2 Stars I really love this", "author": "HB \"BIG_H\"", "createDate": "2007-03-06 00:00:00", "fullText": "bought device fell love screen audio excellent bass boost cool found 40 extra software read mp4 putting pictures noticed kept freezing tried view pictures changing size stopped static notice playback video recorded minute wont notice probably change 4 34 stars", "rating": 4.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12564", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604", "author": "L. Chan \"JC\"", "createDate": "2007-03-20 00:00:00", "fullText": "purchased archos 604 ago interfaces easily computer tried using windows media 10 recommend buying archos docking adapter kit plan using archos record programs allows charge unit computer allows connect directly digital camera transfer photos negative volume level difficult hear airplane noise canceling headphones", "rating": 5.0, "helpfulNum": 6, "totalNum": 6, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12565", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "The Archos 604 exceeded my expectations", "author": "barbandbob \"web shoppers\"", "createDate": "2007-03-23 00:00:00", "fullText": "amazing little product bought amazon price plus 25 bonus coupon using amazon credit card arrived practically overnight free shipping bought optional dvr dock record plugins archos website play movies clips couple issues quickly efficiently handled archos excellent customer service sales staff screen quality perfect comfortably watch length movie gym am machine makes hour recorded device imaginable including portable 7 dvd player hooks dvd record onto 604 real time plays 604 flawlessly play tv video copy protected attaching 604 via usb port pc simply drop movies files unprotected pictures music pc cool zoom pictures upload pictures hook play tv nice slide own music background plays videos tv oh 30 gbs space dont spend extra money gbs length movie clips couple hours tv bunch pictures favorite music memory hardly decreased hold 85 movies store player anyway bottom line archos performs takes bit patience looking manual learn features buttons intuitive hardest setting tv record tv recommend product highly upgraded complaining am carry purse am yes expensive wish included plugins recording feature package worth penny havent satisfaction fun electronic gadget purchase time thinking buying handle price player dvr recorder 79 plugins 30 bundled wont sorry", "rating": 5.0, "helpfulNum": 9, "totalNum": 9, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12566", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Archos 604 w/camcorder accessory", "author": "RoadHawg", "createDate": "2007-04-13 00:00:00", "fullText": "hello usa start video recording distance motorcycle trips researched weeks systems methods deciding archos 604 bought 604 accessories docking station ac adapter travel adapter car charger including helmet camcorder amazon price 604 usd free ship unit dropped price shipped notified amazon price saved 29 pieces 5 days amazons email support 5 stars response time impression 604 unit looks feels hands buttons layout screen unbelievable managed operate wo 1st reading manual upgrade firmware firmware free archos website easy install following site instructions builtin internal speaker weak pumped left primary reason getting helmet cam pleased wthe quality video love overall compact size weight cam remote onoff status lights microphone putting remote jacket reduced overall background noise motorcycle highway speeds able pick voice little muffled live ran straight 49 minutes 40 file size bit 1 gb pleased record session 1st time remote unit archos reboots doesnt matter times start stop recording fine cam draw normal amount battery power specs 55 hours running unit unit wthe cam ran hour ran power battery ran leg trip vids close play marked corrupted system run trials determine total battery time archos car charger bike power accessory plug noticed loading firmware unit run charge time travel adapter adapter plugged tried run unit wthe car charger loading mpeg4 codec free web xp home computer video sound windows movie maker vid trip send grown kids email attachment vids leave desired quality wise hear 640x480 makes viewing robust cam housing velcro helmet comes wthe cam ok bicycle walking helmet tight fit picks edge power considerations spare 604 batteries road dont miss update unit wthe car charger ac adapter plugged battery real warm operating powered unit stopped rebooting 1st vid start power cord short power accessory outlet pocket picked affordable 10 power accessory extension local electronics retail outlet selling radios shack ive trying car cam car wrap holder passenger head accident fault insurance company tape mount pulled court honor tape neither happened wit running flight data recorder car course accident fault dont vid pleased purchase", "rating": 4.0, "helpfulNum": 5, "totalNum": 9, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12567", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Missing software", "author": "Michael Burke \"InteractiveCoursewareEngineer\"", "createDate": "2007-04-28 00:00:00", "fullText": "information prior purchase player play thats based belief purchased discover play mp4 files built message indicating necessity archos site purchase thats serious customer abuse setting expect functional product indicating oh play podcast video thats extra note rating isnt product archos marketing department", "rating": 1.0, "helpfulNum": 8, "totalNum": 21, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12568", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "A really excellent portable video player", "author": "Hari Nair", "createDate": "2007-05-28 00:00:00", "fullText": "ive player couple weeks am impressed music player interface awkward shines portable video player tv capture card computer records mpeg2 format convert mpeg4 computer copy archos unit plane gym battery life 5 hours recommend buying spare battery charged spare bought extra charger read description carefully wall charger usb charger isnt useful especially special software plug computer usb drive mac os linux", "rating": 5.0, "helpfulNum": 3, "totalNum": 6, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12570", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Overall, a solid media player.", "author": "K. Ta", "createDate": "2007-06-10 00:00:00", "fullText": "bought gift mother takes lots photos grand kids using sony digital camera doesnt print hardly chance images besides 2 screen camera doesnt fill 1 gigabyte flash card camera photos moved flash card usually computer archos 604 usb docking adaptor separate accessory view thousands pictures nice 4 screen portable carry purse pictures time buttons hours functional hard learn usb docking adapter allows transfer photos directly camera archos 604 requiring computer plus feature decent slides tight snug fit buy alternative archos sells video music playback alright bought extra software codec mpeg plays videos shot camera music playback okay praise built speakers earphones definitely music unit runs warm slightly hot periods battery life decent depending usage 2 3 hours charge software unit bit unstable sometimes display files imported try times unit recognizes files im hoping future firmware update fix overall solid media player bought mainly photo browsing viewing capabilities im thinking purchasing archos 704 7 screen kids video playback device car mounting strap accessory car car dvd player carry purse pocket 604 portable archos choice portable media players apple ipod 4 bigger screen archos", "rating": 5.0, "helpfulNum": 2, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12571", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Outstanding!", "author": "William M. Mulvihill", "createDate": "2007-06-13 00:00:00", "fullText": "piece electronics described perfect purchased plane week people couldnt believe picture quality purchased mobile dvr player plan movies pick flaw buttons backlight feature dark cant buttons disappointed product", "rating": 5.0, "helpfulNum": 2, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "12572", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Not good for treadmill running", "author": "R. Kerr", "createDate": "2007-06-14 00:00:00", "fullText": "bought archos 604 replace busted ipod video ipod daily treadmill runs gym set treadmill able watch instead tv died decided try 604 larger screen size screen interface crazy archos link software apparently buy software archos watch video podcasts run sweat sweat device happened ipod runs sweat screen disgusting screen usable using purpose device bad star", "rating": 1.0, "helpfulNum": 0, "totalNum": 18, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_pr_link_4/104-0991264-1926349?%5Fencoding=UTF8&pageNumber=4&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2300"}, {"reviewId": "42434", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "A home run.", "author": "Erich Brueschke", "createDate": "2006-09-13 00:00:00", "fullText": "archos 604 video player wonderful piece electronics update av500 takes care predecessors package contained archos 604 1 battery nice ear bud headphones 1 proprietary usb 20 cable charge device transfer content computer setup guide legal stuff dvr station adapter storage sack screen totally amazing bright beautiful 169 layout 30 gig hd people probably size store 810 movies 810 tv leaving 20 gigs music movies tv music files view tv movie times delete movies tv unit space nice 30 unit ie watching viewing angle wide unit constructed plastic metal nice surprise people using plastic save money weight 604 improved surface metal nice brushed surface looks clean fingerprints included sample files 604 abilities video music manual unit pdf file nice feature 604 view pdf files screen nice reading viewing pleasure bought 604 watch stuff unit perfect archos technical support easy call pickup advice putting automated faq system nice surprise 604 replaceable battery dont product cant replace battery battery life wonderful music 14 hours listening music using play videos am getting 4 hours battery exhausted looking pictures listening music falls 7 10 hours interface looks cool lots interactive items connected computer charge sync via windows media 10 mount hard drive installation discs unit windows media 10 free download microsoft installed syncing files required drag drop files 604 hd mode regular hard drive speaker actually sounds considering size perfect office desk listening share video clips friends gathered built kickstand extremely cool makes playing videos watching desk slick built microphone exceptionally picks sounds photo viewer fun slide rotate etc listen music view pictures wonderful feature start listening music switch viewing photos disappointed comes cables play video television unit useful watching video dvr house tivo similar additional addon 604 featured dvr route suggest getting 504 bigger hd pay additional storage size buy cables enable record live navigation buttons bit getting course design simple straight forward unit archos website firmware update download section archos 604 update adds functionality bad storage bag useless provides protection bag dont worry people selling skins unit soon update pass review archos 604 past 3 weeks am impressed wrote review unit light compact offers ipod course gain beautiful screen doing ipod similar cant archos workout cardio currently watching lost time flies connecting transferring files archos 604 update october 4th 2006 played display setting brightness discovered reduce brightness minimum level super acceptable viewing imo extra 1 hour viewing videos update october 2006 h264 aac sound plugin released days ago downloaded installed easily plugin tied unit sharing reason convert ipod videos archos play perfectly plugin plug 1999 dvd video plugin perfectly installed watched wonderful dvd movies convert format plugin 1999 wish archos included original price update december 5th 2006 archos 604 date supports following files types require plugin archos website details divx xvid wmv wma m4v mpeg4 mpeg2 vob mpg ps mp4 ac3 acc mov h264 summary cool device easy eyes blows portable video player pmp market price incredibly low offers low price item watching video sale 604 joy am quality tv dvd movies matter size perfect larger cumbersome produce eye strain video ipod overall continue happy bought archos 604", "rating": 5.0, "helpfulNum": 167, "totalNum": 169, "commentNum": 5, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42435", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Great Device for Newcomers", "author": "Ron Crossland \"factoid junkie\"", "createDate": "2006-10-08 00:00:00", "fullText": "archos av500 user time 604 replacement device av500 joined wonderful world portable screen entertainment archos 604 excellent choice av500 users id recommend holding onto current device recently purchased returned 604 following reasons 1 screen larger supporting colors bright nor significantly av500 yeah adjusted brightness levels devices similar levels comparison 2 lack dvr capability box recording dvd player television device feature 604 support codecs types digital files mpeg4 mpeg2 etc av500 hoping slimmer device brighter screen kickstand 350 device essentially thick bit similar screen kickstand users archos definitely quality product av500 users disappointed upgrade", "rating": 4.0, "helpfulNum": 17, "totalNum": 20, "commentNum": 2, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42436", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Great product", "author": "Buckwheat", "createDate": "2006-10-10 00:00:00", "fullText": "archos started portable video players 6 7 ago tried continue improve evolve basic machine imho update predecessors box packaging plain fancy packaging comes digital players imo spend development player cool packaging box box contains archos 604 1 replacable battery ear buds proprietary usb 20 cable charging device transfering content setup guide dvr station adapter piece crap storage bag screen awesome bright 169 layout wa wide viewing angle thick 60g ipod surface player screen operational buttons little trial error functional unit constructed plastic metal metal nice brushed surface looks clean fingerprints similar av500 looks lot stylish navigational buttons intuitive charging unit download firmware version manual contained pdf file wa pdf manual unit website version interface pretty cool sporting animated icons basic connecting computer charge sync via wmp mount hard drive pretty hate wmp 11 bit chose latter transfer speeds pretty quick music photos videos converted hd iriverter convert dvds efficiently sony headphones dont included earbuds wall devices purchase music sounded pictures crystal videos impressive slide basic effects watch whilst listening tunes music gapless load view pdf files havent speaker sounds youd expect little soft volume handy occasions headphones earbuds impractical built kickstand nice feature unit flat surfaces built microphone tried record tv vhs dvd player dvr requires optional 99 list dock isnt bad considering low initial price unit dock enables transfer photos directly digital camera im video straight camcorder plan picking dock available battery life advertised 14 music 8 music slideshows 4 video cant answer ill try update using unit bit ill saying awesome machine stated navigational buttons getting storage bag joke charged via usb device perfect built feature packed quality 30g unit amazing price portable video device plays music alert dap stand portable video player stand", "rating": 5.0, "helpfulNum": 21, "totalNum": 23, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42437", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "The perfect balance of portability and usability", "author": "Big Fudge", "createDate": "2006-10-27 00:00:00", "fullText": "screen size 30g ipod seriously lay ipod 604 size screen video beautiful didnt consider photo viewing capability bought screen family pics visit 604 light forth subway lives shoulder bag flights train rides 604 shines screen bright crisp playback flawless leave laptop home watch movies biggest selling osx windows compatability 604 mounts drive os simply drag content forth am stuck wmp itunes actually guess am stuck itunes wmp lol navigation takes getting menu button intuitive havent manual personally ipod simple music player video laughable sansa music argue 604 perfect balance portability usability video music", "rating": 4.0, "helpfulNum": 19, "totalNum": 20, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42438", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "bad experience with this product", "author": "Jie Ma \"Jay Ma\"", "createDate": "2006-11-02 00:00:00", "fullText": "files video libraries played player supports limited codecs plan support real media future bought plan dvr supporting dvr station available market reasons makes player useless besides interface easy navigate theres protection skin market protect device am afraid bringing gym fall break sound quality ad ipod desirable music player dvr station 2 weeks mine ebay", "rating": 1.0, "helpfulNum": 3, "totalNum": 29, "commentNum": 4, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42439", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "I'm in love with it", "author": "dOc \"undergroundmuzic\"", "createDate": "2006-12-06 00:00:00", "fullText": "ive 604 3 months couldnt complete day schedule recordings late night sleep watch desk morning movies tv video trailers movies games pdf manuals cell phone treo quick access im finding bad info written previously 604 504 supports mpeg2 format vob mpg ps extensions mpeg4 mp4 ac3 acc divx xvid wmv wma m4v mov extensions encoded h264 archos releases firmware plugins pros portable dvr player record own tv movies pay lcd picture quality photo album kick stand music player unless av500 archos software sync windows media player easily drag drop cut paste files windows explorer delete file pc cons 30gb considering video collection adding deleting files option larger hdd nice eventually fill wish bigger stupid cycle apple taking thier consumers doesnt record box buy dvr station record own archos currently charging additional codecs battery charged usb unless buy adapter archos provided product love portable video youre video file collection movies tv dont collection buying dvr station isnt bad idea considering networks charge download thier internet", "rating": 5.0, "helpfulNum": 29, "totalNum": 30, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42440", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Glad I finally pulled the trigger", "author": "hubbalicious \"hubbalicious\"", "createDate": "2006-12-08 00:00:00", "fullText": "coworker considering buying archos time considered av500 av700 whichever model av500 prices prices ipod creative decision nobrainer decision 404 504 604 reason chose 604 504 size 504 little thicker 604 bulky im pleased sleek unit reason chose 604 404 169 ratio youre getting archos probably means watch lot video screen pretty nice picture vivid colors bright decent sunlight tested direct sunlight buttons little tough figure dont read manuals learned features interface fairly straightforward content onto unit similar creative players archos folder dragdrop copypaste etc dvr dock sold separately output choices component svideo rca aspect archos allows increase features ability buy archos lower price seeking dvr capability overall stylish unit looks person pictures dont archos limited playable content close competitor cowon a2 videos encoded ac3 audio archos play content apparently mp4 purchase plugin 1999 support watch lot asian movies files considering purchased archos advantage cowon a2 apparently support buy addons dvr functionality able charge ac outlet plus people trim extras price low speakers adequate lower volumes lacking volume picture little blurry fast action overall am pleased archos 604 purchase worth wait dislikes sound cowon a2 yes completely honest specific reasons diminish impression archos favor archos gf usually ignores talk gadgets told archos getting cowon rid youve considering getting recommend archos qualify recommendation strongly consider looking dvr capability playback tv archos looking pure video player consider cowon comment noticed tagged archos ipod im youre remotely considering ipod video option archos dont belong yes product call ipod killer update archos gf cowon a2 sidebyside comparison list archos easier interface learn buttons loads videos quicker scheduler tv recording little slimmer feels little solid overall typical user cowon flexibility types files playable features built recording capability builtin fm tuner recorder prettier external design menu slightly advanced menu interface confirm earlier archos probably superior unit overall cowon offer features users particular andor little technically technologically savvy", "rating": 4.0, "helpfulNum": 32, "totalNum": 33, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42441", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "NO RAW file support!", "author": "A. Pizzinini \"andreaspizzinini\"", "createDate": "2006-12-29 00:00:00", "fullText": "following review photographer main reason buy product backup store photos canon harddisk fast viewer photos shoot photos jpg raw format upgraded archos former av 420 support jpg raw backup canon photo viewer incredible slow dont information storing raw format archos bought product believe upgrade cant mean step development error dont support raw plan support raw file future answer decided raw format nevertheless picture viewer video fine store raw files past forget thanks archos easy photographer change backup system companies creative", "rating": 1.0, "helpfulNum": 0, "totalNum": 10, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42442", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Best of both worlds!", "author": "Alan E. Moore \"Choklat Luvr\"", "createDate": "2006-12-31 00:00:00", "fullText": "purchased archos 604 reading reviews cnet cowon creative alternatives overall am extremely happy 604 comparing creative zen ipod video archos 420 id blows mainly bought top spot audio video collection players love 1 love beautiful bright crisp screen screen die 2 allows connection windows media player hard drive convenient plus using zen 3 supports video formats easily player ive tried rarely convert wmv avi file play thats videos bought plugin supports 4 create edit delete screen effective creating playlists unit love feature severely lacking ipod limited 5 navigation buttons little practice admit whip music library quickly easily 2000 songs bit difficult navigate ipod 6 battery life havent battery youve played video ipod impressive 7 love built kickstand 8 sound quality power excellent compare sound pumped bose car stereo top rating 604 zvm ipod 420 9 mention love beautiful screen worth mentioning twice course perfect likes downside product purchase 1 kinda slow boot 2 buy plugin support formats dont archos doing apple forcing pay basic unit 3 cant decent save life course thats downside buying ipod surprise 4 easy play blind unlike ipod zvm cant reach pocket push button sound push ok button music resume makes slightly convenient music player feel features outweigh minor flaw main player 5 im trouble creating playlists partly windows media player little difficult purpose easiest create playlists unit opposite ipod 6 getting weird playlist behavior save playlists playlists name software bug hope plan fix soon 7 cant simple wall charger cable plug ipod usb charger overall surprised becoming favorite music video player amazing expected continue top music player hence 5 star rating spite flaws", "rating": 5.0, "helpfulNum": 1, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/515"}, {"reviewId": "42443", "productName": "Archos 604 30 GB Ultraslim Portable Digital Media Player and Recorder (500860)", "title": "Great Media Player", "author": "B. Kirk \"Pwnage\"", "createDate": "2007-01-04 00:00:00", "fullText": "media player amazing impressive interface features supports nearly format tried product paired cool accessories dvr station camera makes buy reasons 4 instead 5 button layout somewhat challenge button left basically strange setup id reason built speaker sub par isnt deal basically using headphone mp3 player", "rating": 4.0, "helpfulNum": 0, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWQE/ref=cm_cr_dp_all_summary/104-2789358-0673562?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/5158"}]