[{"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "Beware", "author": "A Reader", "createDate": "2005-12-08 00:00:00", "fullText": "mp3 player inexpensive creative easy nicely designed stopped six months figured id try sony homework unit flimsy design awkward sonys sonic stage transfer files takes forever compatable itunes im tech person gather playing atrac files mp3 tried convert mp3 files atrac using sonic stage 50 time maybe doing wrong invested 3 hours couldnt half files play white youre buying", "rating": 1.0, "helpfulNum": 11, "totalNum": 18, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "The Bean works great for more casual users.", "author": "C. Cleary", "createDate": "2005-12-17 00:00:00", "fullText": "mp3 player gym bean half price ipod super light held naturally running transfer cds takes minute tranfer cd ive downloading single songs sony connect sound quality fine battery lasts time convenient features plug bean directly computer cords worry overall met perfectly", "rating": 4.0, "helpfulNum": 7, "totalNum": 8, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "Awesome!", "author": "Scott T.", "createDate": "2005-12-28 00:00:00", "fullText": "received player christmas girlfriend immediately impressed size unique design despite negative reviews posted fine player size price ipodlike device mp3 player gym yes software comes bit bloated clunky simpler program downloaded directly sonys website require sonicstage program allows simply draganddrop music files window quickly converts player sonicstage customize organization files player little yes software personally dont worth rating player sound quality goes headphones device leave bit desired buy mp3 player headphones comes doubt sound quality own set earphones spectacular choose convert files atrac3 format squeeze little extra time 512mb storage shape size perfectly ergonomic fits hand comfortably layout jog switch design switch serves cover internal usb dongle makes easy adjust volume track position running dont itunes issue personally am fan ipod itunes produced apple im pc vs mac guy im disgusted apples marketing tactics lack customer namely continue selling overpriced mp3 player defects ie power interruption fatal flaw digress main drawbacks unit prevent giving 5 stars following 1 beltclip style carrying currently available carrying device armband sold directly exclusively personally am fan armband chosen generic clip shorts gym 2 sonicstage software clunky hang worth sweet player actually thats hope helps", "rating": 4.0, "helpfulNum": 59, "totalNum": 61, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "Great player!!", "author": "", "createDate": "2005-12-28 00:00:00", "fullText": "recently mp3 player christmas beyond expectations player lightweight fits pocket dont feel music playback radio charged battery amazed fast hour earbuds ok buys mp3 player ear buds built usb connector dont mess usb cables music display bright display viewing low light sonic stage takes little workable overall player perfect compact lightweight mp3 player", "rating": 5.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "Great Product", "author": "Suzanne K. Cerneka", "createDate": "2005-12-29 00:00:00", "fullText": "mp3 player wonderful experience hesitant buy husband bought christmas connect store user friendly bean convenient trouble running sitting house love", "rating": 5.0, "helpfulNum": 6, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "Spiffy Little Bean!", "author": "L. Beem", "createDate": "2006-01-03 00:00:00", "fullText": "mp3 player christmas cool stock store closes couple nights week stick pocket shuffle dont touch rest night comes coupon 5 free downloads connect music store mine remember register device store else cant songs youve downloaded onto player im online im friends im cds putting songs songs dont skip battery lasts plugged computer youre loading songs onto charging anyways love dont cuz im weird cant songs player im putting songs probably cant figure", "rating": 5.0, "helpfulNum": 4, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "Nice for the price", "author": "J. R. Mooney", "createDate": "2006-01-11 00:00:00", "fullText": "drawbacks player display takes getting slightly flimsy feel spite display makes nicer shuffle slightly price manipulate listen thats nice feature feels flimsy personal knowing abuse stand extra care im impressed capacity 512mb twice song storage daughters shuffle memory im unimpressed sonys music store music comes own cds minor plan buy armband dont carry hand light overall player running requirement ive changed sports headphones supplied ear buds", "rating": 4.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "Iffy at best", "author": "Ciar", "createDate": "2006-01-15 00:00:00", "fullText": "item flimsy bought teenage sons realize time bought charge plugged computer carrying available weeks fallen coat pocket floor waist height drop destroy modern electronics destroyed addition truly play mp3s software music player register player player computer computers house sony personal info computer player wiped reloading music positive note dropped sound quality market belt carrying armband worth risk carrying stand little expensive risk falling pocket", "rating": 2.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}, {"productName": "Sony NW-E305 Walkman Bean 512 MB MP3 Player White", "title": "mediocre player at best", "author": "T. Wang \"techguy\"", "createDate": "2006-01-21 00:00:00", "fullText": "player gift sony requires install sonic forge software music player mp3 files transferred ok play music player issued except play message mp4 files support means music downloaded apple music store playable", "rating": 2.0, "helpfulNum": 6, "totalNum": 8, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000AZ00EQ/ref=cm_cr_dp_all_summary/102-8915262-9729707?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1192"}]