[{"productName": "Archos 104 6GB MP3 and WMA Digital Music Player and Photo Viewer, Black (500863)", "title": "Slow Hard Drive Access and Ackward User Interface", "author": "M. Nguyen", "createDate": "2007-07-20 00:00:00", "fullText": "archos 104 month am pretty happy purchase details occasionally annoy purchased player protected wma files yahoo music unlimited loading music pleased ive windows media player 11 comes windows vista sync podcasts download player battery life commute battery lasted arrive home player 12 hours im meetings etc annoying shuffle mode skip song theres 23 gap compared girlfriends ipod time user interface little counterintuitive complicated switch shuffle playlist", "rating": 3.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWMS/ref=cm_cr_dp_all_summary/104-8768372-3231963?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/514"}, {"productName": "Archos 104 6GB MP3 and WMA Digital Music Player and Photo Viewer, Black (500863)", "title": "Great fidelity, moderate volumn.", "author": "Chris W.", "createDate": "2007-12-03 00:00:00", "fullText": "initially purchased apple ipod nano happy sound quality trying various eq settings returned unit purchased archos 104 sound checked store outstanding sound quality definitely ipod nano advantage archos modes interfacing mode tightly integrated windows pc software apple ipod itunes mode mode archos configured interface computer standard flash memory drive permits archos operating system supports usb flash memory drives ie windows macos linux etc mode user specific application itunes manage music library flash drive mode music simply copied file copy operation music copied flash drive mode software inside archos scan id3 tags newly added music update internal database organizing album artist track genre etc file browse mode enables user ignore organization navigate files directories directly issue unit volume simply low ipod nano mp3 player tried able drown horrible music gym unfortunately archos unable deliver volume recommend unit fidelity listening environment little background noise", "rating": 3.0, "helpfulNum": 1, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000HAVWMS/ref=cm_cr_dp_all_summary/104-8768372-3231963?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/5140"}]