[{"reviewId": "2066", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Aw, come on", "author": "George Kaplan", "createDate": "2006-04-21 00:00:00", "fullText": "look isnt perfect absolutely else yes call customer service exceedingly helpful running suite space limited fine typical sound quality portability terrific ipod times dont wear plug ipod sound try", "rating": 4.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2067", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Oh My Gosh! ", "author": "", "createDate": "2006-04-23 00:00:00", "fullText": "sooooo annoying literally hours figure stupid reading instructions included doesnt help mine months ago update songs everytime tried frustrated throw window download songs step actually manage songs ones arent library hard figure doesnt window media player difficult songs device am patient stand alarm clock freezes lot late school functions rhyme reason day doesnt doesnt hold songs radio doesnt cant slip pocket alarm doesnt takes music actually cant rewind fastforward songs ive spent hours hours trying songs tha cheaper mp3 player space songs windows software anymore sits songs alarm isnt worth", "rating": 1.0, "helpfulNum": 1, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2068", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "PLEASE DO NO BUY THIS PRODUCT!", "author": "Deborah J. Swope \"DJ music Lover\"", "createDate": "2006-05-30 00:00:00", "fullText": "purchased mp3 player couldnt battery charge called phillips representative push reset button didnt called phillips five times week period finally representative refurbished player course am upset item dont believe received thinking purchasing item please twice phillips help read negative feedback didnt believe bought lucky hate care consumers item 0 stars", "rating": 1.0, "helpfulNum": 5, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2069", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "A unique product", "author": "Remmib", "createDate": "2006-06-17 00:00:00", "fullText": "looking memory based sound system time glad found product dont mind paying larger storage size 1 2 512mb philips offering getting started music playing 1 hour box previous experience philips mp3 helped main player play children songs 15 months kid loves unit music carries happily music plays couldnt mp3 players headphones ipod protable unit lock blank signs life plugged resulted customer service call reseting box issue am pleased product exist cant product portable mp3 player speakers product perfect 3 stars usb 11 slow takes time load music music match synch music easy sound quality similar alarm clock radio midrange bass treble isnt particularly expect tiny speakers", "rating": 3.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2070", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Great Covenient Player", "author": "M. Mangin \"Mrs M\"", "createDate": "2006-07-25 00:00:00", "fullText": "im mom hear instrument day provides music kids love moving purchased 250 mb power call philips trouble shoot luck send dime replaced 6 weeks upgraded 512 mb unit trouble whatsoever 512 reset ease loose battery life builtin rechargeable downloading simple transfer cd music easy am fiddle instructions volume loud headphones carry cds car portable speakers kids dvd player alarm clock auto shutdown etc play music artist type shuffle repeat holds plenty music built radio portable vacation cabin obviously pocket wonderful idea satisfied", "rating": 4.0, "helpfulNum": 4, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2071", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Nightmare -- Don't Buy This Thing", "author": "S. P. Jacobs \"TechnoFiend\"", "createDate": "2006-11-05 00:00:00", "fullText": "cute looking device bad doesnt firmware software combo horrible simply drag drop songs device philips branded version musicmatch jukebox transfer songs phone calls philips didnt help polite otherwise useless ive owned mp3 players introduced time wasted trying", "rating": 1.0, "helpfulNum": 3, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2074", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Cannot load songs", "author": "Nash Jaffer", "createDate": "2007-06-08 00:00:00", "fullText": "spent 3 days trying songs mp3 player finally time musicmatch jukebox starts coming error musicmatch jukebox experienced error close usb hard drive copy files using windows explorer listen device unless songs downloaded thru musicmatch serves storage device emailed philips customer service described issue detail email answer read faq answer called philips customer service rep uninstall reinstall stay phone call told times multiple computers try needless error decided call philips am dissappointed product dissappointed philips customer service considering buying philips screen tv experience consider philips product", "rating": 1.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2075", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "This is a great little gaget", "author": "G. Rivis \"yorkshire bloke\"", "createDate": "2007-11-13 00:00:00", "fullText": "bought 150 ago recent 60 little trouble using features transfering files dont music match xp windows media player fine neat piece free software called buddy excellent transfers creating playlists buddy fine vista cons expand memory wish sd card slot occasionally reset unit start using pencil press reset button player", "rating": 5.0, "helpfulNum": 1, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_2/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=2&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1237"}, {"reviewId": "2076", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Very annoying! Don't buy it!", "author": "A. Chen", "createDate": "2007-12-05 00:00:00", "fullText": "ill short review 256mb version word annoying philips forced musicmatch software load songs annoying difficult reviewed doesnt resume stopped goes song annoying youll buying cheap mp3 player separate powered mini speaker doesnt look nice fine regret buying philips", "rating": 1.0, "helpfulNum": 1, "totalNum": 1, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_pr_link_3/103-4060847-7369467?%5Fencoding=UTF8&pageNumber=3&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/1238"}, {"reviewId": "19879", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Shoq-ingly good!", "author": "R. Sullivan \"Gina\"", "createDate": "2005-11-10 00:00:00", "fullText": "looking personal mp3 player traveling headphones stumbled 512mb surfing chance am satisfied product sound little box outstanding size perfect cabin cruise hotel beach clock radio sounds lot detachable antenna fm radio stationary drawbacks 1 memory expandable play line mp3 player laptop 2 takes average download songs pc using required included musicmatch jukebox software nice portable speaker system thumbs", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19880", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Great sound, nothing else good", "author": "Brent G. Richards \"Brent\"", "createDate": "2005-11-15 00:00:00", "fullText": "sound quality device mine alarm clock 2 nights row clock hard frozen wake dont trust look frozen hard frozen reboot none buttons updated firmware ready prime time alarm clock please heed reviews gotten bad bad design flaw", "rating": 1.0, "helpfulNum": 13, "totalNum": 16, "commentNum": 1, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19881", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "A very good sound", "author": "", "createDate": "2005-12-27 00:00:00", "fullText": "fist bit dissapointed sound sounded picked send family japan gift dont buy alarm clock mean buy clock specifically designed alarm clock", "rating": 4.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19882", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Not Microsoft Friendly", "author": "John L. Hoffman \"Twenty Yr SW Engineer\"", "createDate": "2005-12-27 00:00:00", "fullText": "liked concept device actually purchased son christmas reviewer found device windows media player microsoft friendly locked multiple times proprietary music download interface load properly windows 2000 advanced server agree device ready prime time 512 mb compact flash slot baby", "rating": 2.0, "helpfulNum": 5, "totalNum": 5, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19883", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Philips ShoqBox PSS115-120 falls short", "author": "E. Mondragon \"ed_tech_guy\"", "createDate": "2006-01-03 00:00:00", "fullText": "owned mp3 players knowledge bad mp3 players player worst ill cover positive negative review positive sounds size built waking music fm station using internal clock id tag display provide additional info negatives 1 philips assumed owner play music tracks short play lecture files ebooks etc completed sitting resume play left file list files unit switched fast forward rewind increments slow left 2 file handling system controlled musicmatch merely add mp3s player via usb connection musicmatch control hands hoping purchase download music files computer 3 internal flash ram serious users 4 entire unit shipped replace internal battery goes bad negatives weigh positives recommend player", "rating": 1.0, "helpfulNum": 12, "totalNum": 14, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19884", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "you take your chances", "author": "E. Thulin", "createDate": "2006-01-18 00:00:00", "fullText": "mp3 boom box quickly reviews buyers ready prime time etc lucky poor experience rio nitrus mp3 player chances arrives due overnight shipping unit power period hours charge time products chances", "rating": 1.0, "helpfulNum": 3, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19885", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Didn't work", "author": "Dom", "createDate": "2006-02-06 00:00:00", "fullText": "reviews received item power exchanged amazon exchanged customer service third power useless amazon stock 3 1 cant comment features couldnt concept maybe replaceable batteries idea course expandable memory", "rating": 1.0, "helpfulNum": 2, "totalNum": 2, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19886", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "A Great Idea That Needs to be Refined", "author": "T. Bartolucci \"Pastor-Theologian\"", "createDate": "2006-03-14 00:00:00", "fullText": "time walked busy warehouse shopping center heard incredible sound coming little box size hot dog lengths thats thats little gizmo 3 stars months ago bought 256k models anticipation plugged waited waited waited neither charge nor power exchanged talk philips representatives neither whom help dead units returning 2 warehouse employee tried 3 store plug supposed charging icon 15 minutes leave charging 36 hours straight according product manual charge 4 hours strikes youre left store day money searched vain comparable mp3 player builtin speakers deliver sound david versus none found fool shame fool twice shame fool times tried fourth unit refurbished amazon hey arrived timely manner plugged couldnt believe left plugged days unplugged decided package amazons return department days id try plugging time viola life jumped 12 found school canceled idea buy suggest charge day unplug leave day plug try positives truly delivers incredible sound respectable volume size twin drivers refuse distort volume setting fit finish sort looks white ipod sound comes set ear phones youll supply own equal ipod iriver costing twice plus builtin fm transmitter 10 station presets onscreen menu included software easy doubles clock radio philips website offers firmware upgrades negatives trying starters builtin memory comparison mp3 players im glad payed extra dough harder unit kid door carrying 30 meg shirt pocket laugh tell windowsbased musicmatch jukebox software download music manage files appreciated bookmark feature listening lectures comments ipod iriver cant appointments view photographs color otherwise fm reception requires using earphones included wire fm antenna port nice compartment access speaker little fingers object book bag purse pocket driver included carrying protection bugs philips expand memory capability add features 5star product", "rating": 3.0, "helpfulNum": 2, "totalNum": 3, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19887", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "worth the price", "author": "J. Martinez", "createDate": "2006-03-30 00:00:00", "fullText": "enjoy product sams club 50 bucks couple recomend dont run people plug untill installed software read manual disc connect device usb computer usb unplug device safely remove hardware botton hand monitor skipping simple step result device freezing probably reset button device manager specifically product resetting device original factory settings updating firmware download firmware aware press track skips little annoying firmware allows windows media player load playlist able load music besides music match bad am enjoying product extended warranty five bucks concerned freaked reviews posted id bet resolved improvement definately expandable memory ogg vorbis example fifty reasonable device built alarm clock digital audio player advertised original packaging alarm clock 99 cent store mentioned devices volume fill decent bass ive people believe loud hear minimal distortion volume perfect enjoy", "rating": 5.0, "helpfulNum": 2, "totalNum": 4, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/299"}, {"reviewId": "19888", "productName": "Philips PSS120 512 MB MP3 Personal Sound System", "title": "Power problems now solved", "author": "csprof", "createDate": "2006-04-17 00:00:00", "fullText": "reviewers trouble units power sent bit determined try none troubleshooting material helped finally wrote philips sent link faq page below hadnt found site battery depleted wont properly charged solve pressing reset button paperclip press pretty hard maybe broken mine units display light time unit sound package enjoy heres link philips faq", "rating": 3.0, "helpfulNum": 7, "totalNum": 7, "commentNum": 0, "webUrl": "http://www.amazon.com/review/product/B000BNSIDM/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/2991"}]