[{"productName": "Nextar MA99T-5GL 512 MB Digital MP3 Player with FM Radio (Gunmetal)", "title": "Not so good....", "author": "J. Pribe \"O|||||||O - Jeepin' Joe\"", "createDate": "Fri Jul 21 00:00:00 CST 2006", "fullText": "broken box plastic trim window display protective wrap music player super glued unit feels cheap built metal finish scratches easily buttons miss mean pressing button trigger playpause button instead menu system marginal considering player 7 buttons player 25mm jack instead 35mm jack dig adapter mentioned item description purchased based honestly manufacturer easily standard jack player chance verify battery life package positives file transfer snappy screen easily read fm function headphones headphone cord acts antenna fm record useless feature simply opinion voice recording quality selectable 3 quality settings functions quick notes minute bought gym guess goes consider disposable due poor build quality products available dollars highly recommend finding player advice call friend", "rating": "2.0", "helpfulNum": "8", "totalNum": "9", "commentNum": "0", "webUrl": "http://www.amazon.com/review/product/B000F4X9FY/ref=cm_cr_dp_all_summary/002-0782339-6845654?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/431"}, {"productName": "Nextar MA99T-5GL 512 MB Digital MP3 Player with FM Radio (Gunmetal)", "title": "Rechargable battery does not work", "author": "Abraham L.A.", "createDate": "Sun Apr 15 00:00:00 CST 2007", "fullText": "bargain player quality price slow control response poor documentation real player rechargeable battery connect usb cable battery starts connect disconnect charges battery disposable player hate bought advice dont buy poor player", "rating": "1.0", "helpfulNum": "0", "totalNum": "0", "commentNum": "0", "webUrl": "http://www.amazon.com/review/product/B000F4X9FY/ref=cm_cr_dp_all_summary/002-0782339-6845654?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/431"}]