[
  {
    "reviewId": "54419",
    "productName": "SanDisk Sansa Clip 2 GB MP3 Player (Pink)",
    "title": "Sansa Clip 2GB - Great MP3 Value and Performance!",
    "author": "Mark \"Technology, Music and Movies\"",
    "createDate": "2007-12-17 00:00:00",
    "fullText": "sandisk sansa clip 2gb value mp3 player twice capacity ipod shuffle 5060 screen fm tuner voice recording 1gb version 35 pros sound nice capacity decent price lightweight fm tuner 20 presets voice recording nice design color options nice format compatibility mp3 drm wma wma audible usb 11 20 connectivity usb drive mass storage sync music drag drop via software 15 hours battery life creative clip plus integrated clip means addon lanyard purchase cons larger body 2nd 3rd generation ipod shuffles sandisk sansa clip advantages ipod shuffle compatibility feature price benefits mp3 players unlike sansa express plug directly usb port clip standard usb cable clip definitely little bigger ipod shuffle feel nicer clip priced holidays fills market starter mp3 workout unit gift rechargable battery creative zen stone plus respectable 15 hours sound nice earbuds passable beginners people replace durability time tell holding nicely definitely recommend larger 2gb option space explore creative zen sandisk sansa sansa view ipod nano units price tags sansa view 8 gb mp3 playera sansa view 16 gb mp3 playera zen 4 gb blacka zen 8 gb blacka zen 16 gb blacka sdmx44096 sansa e260 4 gb mp3 player sd expansion slota sdmx48192 sansa e280 8 gb mp3 player blacka 4 gb ipod nano aacmp3 player silver 3rd generationa 8 gb ipod nano aacmp3 player black 3rd generationa overall awesome starter unit deserves try enjoy",
    "rating": 4.0,
    "helpfulNum": 16,
    "totalNum": 16,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B000XQT4PI/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/838"
  },
  {
    "reviewId": "54420",
    "productName": "SanDisk Sansa Clip 2 GB MP3 Player (Pink)",
    "title": "Great MP3 player for 1st time owners",
    "author": "Big Cheena",
    "createDate": "2008-01-16 00:00:00",
    "fullText": "researched mp3 players weeks decided clip start stated 2 gb clip reviews little mp3 player cute mp3 player found easy ive 2 weeks firmware update clip mainly audio books netlibrary overdrive npr podcasts overall supposed affordable price downsides bookmarking beneficial netlibrary audiobooks arent broken screen legible somewhat hard read unless hold close car auxiliary plugin id suggest replacing included earphones arent comfortable expected",
    "rating": 4.0,
    "helpfulNum": 3,
    "totalNum": 3,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B000XQT4PI/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/838"
  },
  {
    "reviewId": "54422",
    "productName": "SanDisk Sansa Clip 2 GB MP3 Player (Pink)",
    "title": "Great little MP3 player",
    "author": "S. Boynton",
    "createDate": "2008-01-23 00:00:00",
    "fullText": "bought daughter loves loading music simple drag drop able figure controls couple minutes carries jams sound quality little player adjusted built eq fm radio excellent buy",
    "rating": 5.0,
    "helpfulNum": 2,
    "totalNum": 2,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B000XQT4PI/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/838"
  },
  {
    "reviewId": "54423",
    "productName": "SanDisk Sansa Clip 2 GB MP3 Player (Pink)",
    "title": "Sansa Rocks!",
    "author": "McGenie \"genied\"",
    "createDate": "2008-02-09 00:00:00",
    "fullText": "pay extra bucks ipod beyond dont video mp3 player sound awesome chose clip creative stone display easier read record directly radio update firmware rockin earbuds provided werent bad upgrade set headphones sansa player ive gotten daughter mine",
    "rating": 5.0,
    "helpfulNum": 2,
    "totalNum": 2,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B000XQT4PI/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/838"
  },
  {
    "reviewId": "54424",
    "productName": "SanDisk Sansa Clip 2 GB MP3 Player (Pink)",
    "title": "Great little guy!",
    "author": "E. Christian",
    "createDate": "2008-02-13 00:00:00",
    "fullText": "love little pink guy battery power strong ive charged couple times ear buds whichever headphones obviously controls easier ipod controls opinion easy volume easy lock clip convenient cute ive tiny size adorable recommend player price",
    "rating": 4.0,
    "helpfulNum": 2,
    "totalNum": 2,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B000XQT4PI/ref=cm_cr_dp_all_summary/103-1045630-8745437?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/838"
  }
]