[
  {
    "productName": "Lexar Media 128MB JumpDrive Music USB Drive (MP128-231)",
    "title": "Easy to use, inexpensive, and decent features.",
    "author": "Nick Gaydos \"thynkyr\"",
    "createDate": "2004-03-26 00:00:00",
    "fullText": "ive happy lexar media jumpdrive usb flash drive store files drop play 2 hours audio mp3 wma music easy plugging automatically picked operating system removable drive drivers cd mac os windows linux name itpthe durable fits hand bit navigation fairly intuitive joystick controls quality cant complain earbud headphones comes backlit screen easy eyes battery life pretty decent 1 aaa battery improvement id love belt clip lanyard doesnt",
    "rating": 4.0,
    "helpfulNum": 14,
    "totalNum": 15,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B0000VYJOW/ref=cm_cr_dp_all_summary/104-4751495-8747160?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/44"
  },
  {
    "productName": "Lexar Media 128MB JumpDrive Music USB Drive (MP128-231)",
    "title": "Overall great inexpensive MP3 player - USB drive!",
    "author": "J. B. Donaldson",
    "createDate": "2004-11-19 00:00:00",
    "fullText": "youre looking inexpensive usb drive storing transferring files music types files portable mp3 player plays mp3 superior window media audio wma format buy menu options audio player includes equalizer choose following settings normal rock jazz classical pop boom play mode normal repeat track repeat shuffle shuffle repeat buttons enter random set displayed keys unlock option backlight power saver contrast change lighter darker power saver set unit minutes inactivity disabled media player recognize portable media player transfer music files simply copy files onto jumpdrive audio player windows xp windows media player 10 battery life rated 6 hours alkaline usually rechargeable batteries cheaper minor drawbacks player middle list songs listening unit remember left start beginning nicer set headphone compared comes player sound quality rivals nice cd player depends course sampling quality file listened price cant beat",
    "rating": 4.0,
    "helpfulNum": 16,
    "totalNum": 16,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B0000VYJOW/ref=cm_cr_dp_all_summary/104-4751495-8747160?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/44"
  },
  {
    "productName": "Lexar Media 128MB JumpDrive Music USB Drive (MP128-231)",
    "title": "Impressive......most impressive",
    "author": "Michael Reid",
    "createDate": "2005-02-04 00:00:00",
    "fullText": "jumpdrive music days ago enjoy ten minutes taking packaging songs downloaded onto couldnt product similar usb jump drive mp3 player allinone mainly jumpdrive music treadmill found quick easy transferring files via easy quality bought time ago price drawbacks body wider jump drives recessed usb port computer youll usb extension cord comes reach thats bad convenience belt clip issue vote im planning looking maybe cell phone belt pouch fit overall happened comparable market buy",
    "rating": 4.0,
    "helpfulNum": 5,
    "totalNum": 6,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B0000VYJOW/ref=cm_cr_dp_all_summary/104-4751495-8747160?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/44"
  },
  {
    "productName": "Lexar Media 128MB JumpDrive Music USB Drive (MP128-231)",
    "title": "BUY IT",
    "author": "Ricardo \"Ricardo-Brazilian in VA\"",
    "createDate": "2005-03-10 00:00:00",
    "fullText": "received mine loved itits 128mb buy bigger physical size perfect store delivered time advice mp3 player buy",
    "rating": 5.0,
    "helpfulNum": 3,
    "totalNum": 3,
    "commentNum": 0,
    "webUrl": "http://www.amazon.com/review/product/B0000VYJOW/ref=cm_cr_dp_all_summary/104-4751495-8747160?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending",
    "htmlPath": "F:\\amazon_mp3\\1/44"
  }
]