[{"productName": "Visual Land 1 GB MP4/MP3 Player 2 Speakers 2 Headphone jacks VL-546A Blue", "title": "Amazing player! It does it ALL!!!!", "author": "MORE than Satisfied customer.", "createDate": "Thu Dec 22 00:00:00 CST 2005", "fullText": "youre thinking getting mp3 player hesitate purchase player reading positive reviews ahead website transaction smooth notified shipped tracking 2 days player doors hands fast shipping time noticed screen greeted beautiful color display menus organized labeled easily accessible menus proceeded ahead add music player looked manual music pretty straight dont plugged computers usb port running dragged songs computer onto player unplugged computer player easier friends ipod sound headphone built speakers video screen size portability videoaudio sync perfect lot little video clips fun youre little visual entertainment besides video music personal pictures friends family fm radio reception sounds fm radio ive overall am happy player youre looking music videos pictures fm radio voice recorder 1gb storage doesnt comes mp3 players dont price fool player packs punch", "rating": "5.0", "helpfulNum": "8", "totalNum": "8", "commentNum": "0", "webUrl": "http://www.amazon.com/review/product/B000CGJ54O/ref=cm_cr_dp_all_summary/002-4710236-5858468?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/332"}, {"productName": "Visual Land 1 GB MP4/MP3 Player 2 Speakers 2 Headphone jacks VL-546A Blue", "title": "dead device- no customer service", "author": "D. L. couture-johnson \"don2\"", "createDate": "Sat Jul 15 00:00:00 CST 2006", "fullText": "purchased 1gb player april 2006 pleasantly suprised easy download music 35 times week walking dropped recharged weekend appeared charges july 7th 2006 died sent email received reply date sent 3 emails response purchase electronic product internet maybe fault internet manufacturer recommend product goes wrong dont appear support product", "rating": "1.0", "helpfulNum": "2", "totalNum": "2", "commentNum": "0", "webUrl": "http://www.amazon.com/review/product/B000CGJ54O/ref=cm_cr_dp_all_summary/002-4710236-5858468?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/332"}, {"productName": "Visual Land 1 GB MP4/MP3 Player 2 Speakers 2 Headphone jacks VL-546A Blue", "title": "Bought 4 for Christmas 05", "author": "Mama Bear \"Shop-o-holic, am I !!!\"", "createDate": "Thu Sep 06 00:00:00 CST 2007", "fullText": "bought 4 christmas gifts november 2005 picked 1g 2 adult male family 512mb send 1 responded reasonable time pros price time 1g friendly easy load nice quality picture age 50 forget using movie viewer nice sound stopped weeks tried whim 512mb times con reliable stopped 4 months normal hold charge stopped weeks tried whim frequently lasting charges getting weaker 1g left awhile tried recharge overall bought mp3s expensive players time hold visual land reliable battery performance product pretty paid 129 1g 79 512mb", "rating": "3.0", "helpfulNum": "0", "totalNum": "0", "commentNum": "0", "webUrl": "http://www.amazon.com/review/product/B000CGJ54O/ref=cm_cr_dp_all_summary/002-4710236-5858468?%5Fencoding=UTF8&showViewpoints=1&sortBy=bySubmissionDateAscending", "htmlPath": "F:\\amazon_mp3\\1/3322"}]